[{
  "_id": {
    "$oid": "62553c54d09bc9da618255c3"
  },
  "source_id": {
    "$oid": "62553bcad09bc9da618255a1"
  },
  "blog": [
    {
      "title": "Why you should learn C++",
      "image": "http://127.0.0.1:8000/image/16497531729651.jpeg",
      "path": "src\\public\\image\\16497531729651.jpeg",
      "category": "coding",
      "discription": "<p><strong>It can be challenging to choose which programming language you should learn in 2021.</strong> There are hundreds of great programming languages out there. Out of those, choosing which one you should learn is a challenging task. C++ is known to be the most powerful programming language right now. And also, it’s the most popular programming language in the world as well. It’s used for everything from building operating systems to crafting video games and creating 3D movies. While it may have a steeper learning curve than others, C++ has incredible potential. There are many reasons to learn C++. Although C++ is difficult to learn, it’s an overall great programming language for any future tech enthusiast. Many multinational companies like Microsoft, LinkedIn, Opera, NASA, Facebook, etc.. use C++ for their development activities.</p><p>&nbsp;</p><p>C programming language is the mother language of C++. C was created by Dennis Ritchie in 1972. Later on, in 1985 Bjarne Stroustrup developed C++. C was initially developed for UNIX operating systems and to make programming easy. Today, C++ is used to write programs compatible with Windows, Linux and macOS operating systems. C++ is also an object-oriented programming language like Java, which is a type of development using objects and classes.</p><p>&nbsp;</p><p>C++ is known for being a more difficult language to learn than others such as Java, Python and C as well. This can be challenging for those starting with programming. With that said, investing the time to learn C++ can bring a number of benefits to you and your career. The main benefit you can gain from learning C++ is syntax. The C++ syntax is similar to many other programming languages like, So, Rust and Scala. This means once you mastered C++, learning the other complicated programming languages are really easy for you to pick up. C++ is also used in hardware development as well. Knowing how to code in C++ gives you a better sense of how both software and hardware work together.</p><p>&nbsp;</p><p>Let’s talk about the time it takes to learn C++. It obviously depends on your skillset. If you are fairly new to programming, I recommend you start with a language like C or Python and work your way up to C++. If you have some experience in programming and had the chance to gain hands-on experience in languages like Java and Python, you might be able to master the syntax of C++ within 2 to 3 months. But, to really learn a language, expect to learn at least a year of studying and building projects. The best way you can learn a programming language is by building small projects. But, you should learn the basic syntaxes of any programming language first. Although there are C++ developers in large multinational companies, they haven’t even done studying yet since, technology updates day by day. So, If you want to become a good C++ developer you must have the discipline to keep up with new updates and new coding tricks.</p>",
      "like": 0,
      "status": "verified",
      "createDate": "2022/04/12 14:16:12",
      "_id": {
        "$oid": "62553c54d09bc9da618255c4"
      }
    },
    {
      "title": "Programming Languages to Avoid and Learn in 2022.",
      "image": "http://127.0.0.1:8000/image/16497532582402.jpg",
      "path": "src\\public\\image\\16497532582402.jpg",
      "category": "coding",
      "discription": "<h2><strong>Things I didn’t know when I started coding.</strong></h2><p><strong>(Scroll down for a cut-to-bs version)</strong></p><p>We speak so many languages but, how many do we actually CODE in?</p><p>&nbsp;</p><p>It is hard to choose just&nbsp;<strong>one</strong>&nbsp;programming language which is</p><p>&nbsp;</p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;in demand in job market and</p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;will continue to be in —</p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;that too with a high pay scale,</p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;developer satisfaction and</p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;productive! Yes.</p><p>&nbsp;</p><p>and it’s not always that easy to pick one, never will be, :(</p><p>&nbsp;</p><p>there will always be some trade-offs (or is this even a right question to ask?)</p><p>&nbsp;</p><p><em>“because no programming language is perfect!”</em></p><p>one is easy to learn but sometimes slow(<em>Python</em>),</p><p> one is easy to learn but has a tiny userbase and hardly any libraries (<em>Nim</em>)</p><p> one is very fast but a bit hard to learn(<em>C</em>/<em>C++</em>),</p><p> one is incredibly fast, but incredibly hard to learn (<em>NASM</em>)</p><p> one is verbose but in demand(<em>Java/C#</em>),</p><p> one is made by Google(<em>Go/Dart</em>),</p><p> One is everywhere but no one talks about it because it’s favoured by script kiddies (<em>PHP</em>)</p><p> one is used everywhere but saturated job market(<em>JavaScript</em>) and so on…</p><p>&nbsp;</p><p><em>“Languages need hype to survive; I just wish people didn’t have to be blinded by it.”</em></p><p><em>you get the feel, right?</em></p><p>&nbsp;</p><h2>A SHORT OVERVIEW:</h2><p>This article is my personal opinion. Every language is as good as a tool, it’s just how you, the developer, use it.</p><p>&nbsp;</p><p><em>You probably won’t finish this article. In fact, I may have already lost you</em></p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<em>to another tab in your browser.</em></p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<em>Or an email from your boss.</em></p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<em>Or a ping from a coworker.</em></p><p><em>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Or any number of other digital distractions that have come to define your modern life.</em></p><p>&nbsp;</p><p><em>[The below recommendations are for the context of the&nbsp;United States, United kingdom,&nbsp;and other 1st world and some 2nd world (Russia, and neighbours, etc) countries. Scroll down for&nbsp;Indian&nbsp;and&nbsp;Chinese&nbsp;context.]</em></p><p><em>&nbsp;</em></p><h2>YOU SHOULD LEARN:</h2><p>1.&nbsp;&nbsp;&nbsp;&nbsp;<strong>Javascript</strong>&nbsp;— Most used, versatile, easy, large developer community and WORA (Write Once Run Anywhere), scripting, frontend, backend, ML, games, mobile and webApps (be aware of its dependency hell).</p><p>&nbsp;</p><p>2.&nbsp;&nbsp;&nbsp;&nbsp;<strong>Python</strong>&nbsp;— easy to learn, backend, ML, data science, data visualization, scripting, hacking, automation, education and finance sector, web scraping, adoption continues to grow.</p><p>&nbsp;</p><p><br></p><p>&nbsp;</p><p>3.&nbsp;&nbsp;&nbsp;&nbsp;<strong>Dart</strong>&nbsp;— One codebase for Android, iOS, Web App, Windows, macOS(beta), Linux(beta) application, embedded systems (unstable), servers → Flutter.</p><p>&nbsp;</p><p>4.&nbsp;&nbsp;&nbsp;&nbsp;<strong>C#</strong>&nbsp;— Platform agnostic, simple, general-purpose language, desktop, console and web application, windows and web services, game development, VR, AR.</p><p>&nbsp;</p><p><br></p><p>&nbsp;</p><p>5.&nbsp;&nbsp;&nbsp;&nbsp;<strong>Go</strong>&nbsp;— Solves scalability issues, simple elegant code, easy to learn, the language of the cloud, DevOps, backend, servers, microservices, DNS, cloud native development. (Uber, Netflix, Docker, Kubernetes, Soundcloud, Prometheus)</p><p>&nbsp;</p><p><br></p><h2>YOU SHOULD CONSIDER LEARNING:</h2><p>&nbsp;</p><p><br></p><p>1.&nbsp;&nbsp;&nbsp;&nbsp;<strong>Java</strong>&nbsp;— In high demand worldwide, big data, android, finance, databases, system software, testing tools, enterprise king, the core language of industry-standard tools like Apache Kafka, spark, hive, MTLAB is Java based, distributed apps, IoT, Hadoop, etc.</p><p>&nbsp;</p><p>2.&nbsp;&nbsp;&nbsp;&nbsp;<strong>R</strong>&nbsp;— statistics, ML, Data Visualisation, fintech, research, retail, automobile industry, but slow and data-intensive.</p><p>&nbsp;</p><p><br></p><p>&nbsp;</p><p>3.&nbsp;&nbsp;&nbsp;&nbsp;<strong>Kotlin</strong>&nbsp;— server-side, client-side web and Android, (embedded systems, macOS and iOS is coming), gradle plugins, microservices, smart-contracts, backend, data-science.</p><p><br></p><p> <strong>Swift</strong>&nbsp;— Develop for anything that has  on it (iPhone, iPad, macOS, watchOS, tvOS and apps for all of them) versatile, simplification of existing native app development methods, productive than obj-C</p><p>&nbsp;</p><p>4.&nbsp;&nbsp;&nbsp;&nbsp;<strong>Rust</strong>&nbsp;— memory management, systems programming, Linux kernel, game engines, operating systems, file systems, browser components and simulation engines for virtual reality.<strong>&nbsp;</strong>Takes a little time to learn(<em>relative to Go</em>). Good pay.</p><p>&nbsp;</p><p>5.&nbsp;&nbsp;&nbsp;&nbsp;Others → C and Julia.</p><p>&nbsp;</p><p><br></p><p>&nbsp;</p><p><br></p><h2>YOU SHOULD NOT CONSIDER:</h2><p>&nbsp;</p><p><br></p><p>1.&nbsp;&nbsp;&nbsp;&nbsp;<strong>Ruby</strong>&nbsp;— webApps, automation (WATIR), scraping, servers, DNS, but better tools are available now. (<em>Sidenote: Github, Gitlab are written in Ruby on Rails framework, and still the first choice of many startups for easy MVP and fast deployment</em>).</p><p>&nbsp;</p><p><em>2.&nbsp;&nbsp;&nbsp;&nbsp;</em><strong>PHP</strong>&nbsp;— PHP originally stood for Personal Home Page, but it now stands for the recursive initialism,&nbsp;<strong>H</strong>ypertext&nbsp;<strong>P</strong>reprocessor.</p><p> <strong>→&nbsp;</strong>Desktop GUI, web backend, lacks good debugging tools (compared to other languages), relatively low pay, still extensively popular, tough competition from java, E-commerce and public websites King<em>.</em>&nbsp;<em>[Earlier versions of PHP paid less attention to security features, presently, it’s as robust as any other language]</em></p><p>&nbsp;</p><p><br></p><p>&nbsp;</p><p>3.&nbsp;&nbsp;&nbsp;&nbsp;<strong>C++</strong>&nbsp;— bridge between LLP and HLP, memory unsafe, game engine development, OS level, embedded, fintech, trading, compilers, browsers, VMs, can be frustrating to work with. (Visa, Mastercard, Amex all use C++ for their backend system). Do not consider C++ if gaming and hardware programming does not interest you.</p><p>&nbsp;</p><p>4.&nbsp;&nbsp;&nbsp;&nbsp;Super-new and very niche-specific languages which do not have a healthy community.[For more on that, please refer to the end of the article]</p><p>&nbsp;</p><p><br></p><p>&nbsp;</p><p>[Edit: Java is promoted to the ‘<em>You should consider</em>’ section after consideration with industry devs. ]</p><p>&nbsp;</p><h2>FOR WEB3:</h2><h2>Languages:</h2><p>&nbsp;</p><p><br></p><p>Solidity, Javascript, Rust, C++, Substrate.</p><p>&nbsp;</p><p><br></p><h2>Frameworks:</h2><p>&nbsp;</p><p><br></p><p>Truffle Framework, Hardhat Framework, Brownie Framework, OpenZeppelin SDK, Chainlink SDK.</p><p><br></p><h2>FOR INDIAN CONTEXT:</h2><p>&nbsp;</p><p><br></p><p>1.&nbsp;&nbsp;&nbsp;&nbsp;<strong>Java</strong>&nbsp;— Most&nbsp;<em>in-demand</em>&nbsp;language according to Indian Job Market,&nbsp;<em>Safe bet.</em></p><p>2.&nbsp;&nbsp;&nbsp;&nbsp;<strong>Javascript</strong>&nbsp;or&nbsp;<strong>Python</strong>&nbsp;— Master anyone and you are good to go.&nbsp;<em>Period</em>.</p><p>3.&nbsp;&nbsp;&nbsp;&nbsp;<strong>C++</strong>&nbsp;— Use it for Data Structure and Algorithms and Competitive Programming (<em>at Codeforces, Codechef, Topcoder, SPOJ, etc and participate in Hashcode, Kickstarter, Codejam, Hacker Cup, ACM ICPC, etc)</em></p><p><em>Recommendation</em>:&nbsp;<strong>Java</strong>&nbsp;and&nbsp;<strong>Javascript</strong></p><p>&nbsp;</p><h2>FOR CHINESE CONTEXT:</h2><p>&nbsp;</p><p><br></p><p>1.&nbsp;&nbsp;&nbsp;&nbsp;<strong>Java</strong>&nbsp;[29.28%]</p><p>2.&nbsp;&nbsp;&nbsp;&nbsp;<strong>C++</strong>&nbsp;[16.08%]</p><p>3.&nbsp;&nbsp;&nbsp;&nbsp;<strong>Javascript</strong>&nbsp;[15.09%]</p><p>4.&nbsp;&nbsp;&nbsp;&nbsp;<strong>C#</strong>&nbsp;[10.95%]</p><p>5.&nbsp;&nbsp;&nbsp;&nbsp;<strong>Python</strong>&nbsp;[8.21%]</p><p>6.&nbsp;&nbsp;&nbsp;&nbsp;<strong>Go</strong>&nbsp;[6.94%]</p><p>7.&nbsp;&nbsp;&nbsp;&nbsp;<strong>PHP</strong>&nbsp;[5.19%]</p><p>8.&nbsp;&nbsp;&nbsp;&nbsp;<strong>Matlab</strong>&nbsp;[1.48%]</p><p>9.&nbsp;&nbsp;&nbsp;&nbsp;<strong>Lua</strong>&nbsp;[1.28%]</p><p>10.&nbsp;<strong>Swift</strong>&nbsp;[0.83%]</p><p><a href=\"https://github.com/EricWebsmith/china_job_survey/\" rel=\"noopener noreferrer\" target=\"_blank\"><em>Source</em></a><em>&nbsp;here, [xx%] indicates the percentage of developers using that language per 100 dev.</em></p><p><em>&nbsp;</em></p><p>All the programming languages are built for some specific purpose, over time, they deviate towards general-purpose languages (can be used to code almost everything, e.g Javascript, Java, and to some extent Python).</p><p>You have a very slim chances (if you are a fresher) to directly land your first Job if you just know :</p><p><br></p><p> 1.&nbsp;<strong>Rust</strong>, but not&nbsp;<strong>C++</strong></p><p> 2.&nbsp;<strong>Go</strong>, but not&nbsp;<strong>Java</strong></p><p> 3.&nbsp;<strong>Kotlin</strong>, but not&nbsp;<strong>Java</strong></p><p> 4.&nbsp;<strong>Swift</strong>, but not&nbsp;<strong>Objective-C</strong></p><p> 5.&nbsp;<strong>Julia</strong>, but not&nbsp;<strong>Python</strong></p><p> 6.&nbsp;<strong>Dart</strong>, but zero experience with any native app development language.</p><p>You all won’t agree with me on this but thats okay!</p><p>&nbsp;</p><p>Just have a closer look at the Job description of companies who hire folks who know cutting edge technologies, they will have “<em>must have 1–2 years of experience working with [the-language-which-you-hate] language</em>”</p><p>&nbsp;</p><p><strong>People claim PHP runs the world</strong>,</p><p> → Sure, according to % of websites PHP is ahead but hey 1/3 of websites on this planet are WORDPRESS sites and Wordpress is built on PHP, people who do not know to code (or do not want to code) use Wordpress templates and use them, it’s just like duplicating same codebase with minor textual changes and hence PHP wins here, nothing else. Why people moved to Javascript if PHP was that great? Tell me.</p>",
      "like": 0,
      "status": "verified",
      "createDate": "2022/04/12 14:17:38",
      "_id": {
        "$oid": "62553caad09bc9da618255de"
      }
    },
    {
      "title": "This is Your Brain. This is Your Brain on Covid.",
      "image": "http://127.0.0.1:8000/image/16497533078891.png",
      "path": "src\\public\\image\\16497533078891.png",
      "category": "news",
      "discription": "<p>In about 30 seconds, you’re going to call me an “alarmist,” or say that I’m “exaggerating.” In about 60 seconds, your stomach is going to lurch, and you’re going to feel slightly ill. Don’t worry about it—&nbsp;<em>I got you</em>.</p><p>&nbsp;</p><p>In the coming weeks and months, a new variant of Covid is going to emer — oh, why bother.</p><p>&nbsp;</p><p><strong>There are three kinds of people in the world right now.&nbsp;</strong>Those who know it, and accept the basic facts of viral evolution,&nbsp;<a href=\"https://eand.co/if-you-thought-covid-was-over-congratulations-youre-an-idiot-3ee89501df92?source=your_stories_page----------------------------------------\" rel=\"noopener noreferrer\" target=\"_blank\">that it could very well be worse</a>&nbsp;— that’s a small minority of us, fools who believe in a little thing called “science.” There are those who don’t know it — they’re the hopeless kinds of idiots, given the fact that we’re now&nbsp;<em>years into a pandemic</em>. Then there are those who know it, but deny it — they’re the aggressive kind of idiot, who’ll tell you, flat-out, angrily…</p><p>&nbsp;</p><p>Not to wear a mask.</p><p>&nbsp;</p><p>Not to social distance — they’ll get right up in your face and shout it at you.</p><p>&nbsp;</p><p>Not to worry, not to care…</p><p>&nbsp;</p><p>Because don’t you know —<a href=\"https://www.google.com/url?sa=t&amp;rct=j&amp;q=&amp;esrc=s&amp;source=web&amp;cd=&amp;cad=rja&amp;uact=8&amp;ved=2ahUKEwiWxObz0On2AhXIQkEAHXZ6BNUQFnoECAcQAQ&amp;url=https%3A%2F%2Feand.co%2Fis-omicron-just-covid-evolving-to-become-the-common-cold-15e4ed5e6d8e&amp;usg=AOvVaw3KBk7p-NKnqJxQ6skhzDRB\" rel=\"noopener noreferrer\" target=\"_blank\">&nbsp;<em>Covid is like the flu</em></a>.</p><p>&nbsp;</p><p>This kind of idiot…well, what is there to even say. Have you run into such a person? There you are, minding your own business, wearing a mask, keeping your distance — and before you know it, some enraged buffoon is launching flecks of spittle at you, shouting at you to take it off. What is this,&nbsp;<em>Naked and Afraid</em>?</p><p>&nbsp;</p><p><a href=\"https://www.google.com/url?sa=t&amp;rct=j&amp;q=&amp;esrc=s&amp;source=web&amp;cd=&amp;cad=rja&amp;uact=8&amp;ved=2ahUKEwiWxObz0On2AhXIQkEAHXZ6BNUQFnoECAcQAQ&amp;url=https%3A%2F%2Feand.co%2Fis-omicron-just-covid-evolving-to-become-the-common-cold-15e4ed5e6d8e&amp;usg=AOvVaw3KBk7p-NKnqJxQ6skhzDRB\" rel=\"noopener noreferrer\" target=\"_blank\">Covid is&nbsp;<em>not the flu</em>.</a>&nbsp;You are quite right to wear a mask and keep your distance. 30 seconds up. Go ahead, call me an alarmist. Get it out of your system.</p><p>&nbsp;</p><p>Done? Good. My turn. Now I’m going to make your stomach lurch.</p><p>&nbsp;</p><p><strong>Covid isn’t like the flu in one very obvious way —&nbsp;</strong><em>it’s a Coronavirus</em><strong>.&nbsp;</strong>Coronaviruses are&nbsp;<a href=\"https://www.google.com/url?sa=t&amp;rct=j&amp;q=&amp;esrc=s&amp;source=web&amp;cd=&amp;cad=rja&amp;uact=8&amp;ved=2ahUKEwi02cmS0en2AhXUmFwKHQWbC38QFnoECAUQAQ&amp;url=https%3A%2F%2Fwww.nytimes.com%2F2021%2F02%2F05%2Fhealth%2Fcovid-variants-genome-recombination.html&amp;usg=AOvVaw1OvlNOAuR7LMi4ibsjyIva\" rel=\"noopener noreferrer\" target=\"_blank\">masters of mutation</a>, and some of them, like SARS and MERS, are fantastically deadly.&nbsp;<a href=\"https://eand.co/is-the-pandemic-really-over-130402f7b378?source=your_stories_page----------------------------------------\" rel=\"noopener noreferrer\" target=\"_blank\">Recombine Omicron with those</a>&nbsp;— and bang, it’s lights out. Forget it — the idiots don’t care and never will. Sorry — one last try, for old time’s sake.</p><p>&nbsp;</p><p>We’re just beginning to understand something even beyond that, though. The effects of Covid over the long term, which&nbsp;<em>aren’t</em>&nbsp;“Long Covid.” “Long Covid” is a set of symptoms which afflict people in whom Covid seems to turn chronic. The long term effects of Covid mean something very, very different: what happens to seemingly normal people who “get it”, “recover”, and&nbsp;<em>then</em>.</p><p>&nbsp;</p><p>Then what, exactly? Well, like I said, that’s what we’re just beginning to understand.</p><p>&nbsp;</p><p><strong>And the effects are&nbsp;</strong><em>alarming</em>. Uh oh. I said it! Someone, find a stake, and burn me. Or maybe, I don’t know, prepare yourself, because, like I said, your gut is about go numb.</p><p>&nbsp;</p><p>“<a href=\"https://www.google.com/url?sa=t&amp;rct=j&amp;q=&amp;esrc=s&amp;source=web&amp;cd=&amp;cad=rja&amp;uact=8&amp;ved=2ahUKEwiylqyN2-n2AhVPh1wKHXK9CTAQFnoECAQQAQ&amp;url=https%3A%2F%2Fwww.forbes.com%2Fsites%2Fwilliamhaseltine%2F2022%2F03%2F21%2Fa-case-of-shrunken-brains-how-covid-19-may-damage-brain-cells%2F&amp;usg=AOvVaw2poXM8PYFat_6dtD63pujq\" rel=\"noopener noreferrer\" target=\"_blank\">Thanks to a new study from the UK</a>&nbsp;we are now beginning to uncover the effects of SARS-CoV-2 infections in the brain. Comparing brain volume before and after individuals were exposed to SARS-CoV-2, this study documents significant cortical gray matter loss, equivalent to nearly 10 years of aging.“</p><p>&nbsp;</p><p>Did you get that? Let me try that again, for the idiots.</p><p>&nbsp;</p><p>“<strong>Significant cortical gray matter loss, equivalent to nearly 10 years of aging.</strong>“</p><p>&nbsp;</p><p>The bolding’s mine. Alarming is probably an understatement. You probably want to know the methodology of that study. Sure, here you go: “<a href=\"https://pubmed.ncbi.nlm.nih.gov/34189535/\" rel=\"noopener noreferrer\" target=\"_blank\">Douaud et al had unique access to an extensive biomedical database</a>, called the UK BioBank. The UK BioBank provided pre-pandemic brain scans from 785 individuals that were used as a baseline for normal size and structure relative to each participant. About three years later, in May 2021, the same population of participants returned for new brain scans. From the total cohort, 401 individuals were infected with Covid-19 between scans and the remaining served recruited as controls.”</p><p>&nbsp;</p><p>See that? That’s good experimental design. Pioneering, in fact. They studied brain scans three years apart — pre and post pandemic. And the results are both grim and shocking. Cortical loss&nbsp;<em>equivalent to ten years of aging</em>.</p><p>&nbsp;</p><p>It’s not so bad, maybe, some scientists originally hypothesised. It was probably just the portions of the brain responsible for your sense of smell. And who needs&nbsp;<em>that,&nbsp;</em>amirite? Hey, did someone forget to take the trash out again? Meanwhile, there’s a family of badgers the size of mountain goats living in the garage.</p><p>&nbsp;</p><p>But it didn’t turn out to be that funny&nbsp;<em>at all</em>. “Surprisingly, Douaud et al. also found additional abnormalities in regions not normally associated with the sense of smell. In particular, they observed r<strong>educed gray matter volume in some regions of the limbic system, involving several structures important for producing behavioral and emotional responses</strong>. T<strong>he largest differences, ranging from 0.2% to 2% reductions, were seen in the left parahippocampal gyrus and the entorhinal cortex. These regions play an important role in the hippocampal memory system, so gray matter loss could signify future memory impairments</strong>.”</p><p>&nbsp;</p><p>So here we are. Let me try to sum it all up as concisely as I can.</p><p>&nbsp;</p><p><strong>The backwards idiots who surround the tiny minority of the rest of us who are left sane, screaming at us to take off our masks, believe the fairy tale peddled by irresponsible leaders, including the very public health agencies designed to protect us, that all this has become “the flu”…and that fairy tale dooms all of us to get a disease…which can take a baseball bat to your brain and age it by ten years…and that’s just getting it once…to get that disease…over and over again…</strong><em>forever</em><strong>.</strong></p><p>&nbsp;</p><p>Maybe we don’t even&nbsp;<em>need</em>&nbsp;Covid to do us brain damage. Because right about now, we’re acting, as societies, like we never had ones to begin with.</p><p>&nbsp;</p><p>Umair</p><p> March 2022</p>",
      "like": 0,
      "status": "verified",
      "createDate": "2022/04/12 14:18:27",
      "_id": {
        "$oid": "62553cdbd09bc9da618255f0"
      }
    },
    {
      "title": "Improving Valorant E-Sports Experience—UI/UX Case Study",
      "image": "http://127.0.0.1:8000/image/164975898820212.png",
      "path": "src\\public\\image\\164975898820212.png",
      "category": "sport",
      "discription": "<h1>Context:</h1><p>A bit of context, for the uninitiated —&nbsp;<strong>Valorant&nbsp;</strong>is an FPS (first-person shooter) game released by Riot Games in June 2020. As Valorant describes it is —&nbsp;<strong><em>a 5v5 character-based tactical shooter game</em></strong>, where the agent you choose is one of the most important elements of the game as each agent has its own set of abilities, utilities, and ultimate ability unique to them.</p><p><br></p><p>Within months of launching the game officially, in September 2020 Riot&nbsp;<a href=\"https://playvalorant.com/en-gb/news/esports/announcing-valorant-first-strike/\" rel=\"noopener noreferrer\" target=\"_blank\">announced their first Valorant e-sports tournament —&nbsp;<strong>First Strike</strong></a><strong>.&nbsp;</strong>Scheduled for December 2020, the gaming community was ready to see yet another Riot e-sports masterclass (considering their history with&nbsp;<em>League of Legends</em>).</p><p>The event was held on Twitch where the broadcasting team overlays the graphic elements over the game footage from the actual match and streams it for the viewers. So this is the part where I come in. This combination, of game footage and overlay elements, is where the problems mentioned below lies. I am trying to solve the issue of these overlaying elements and the value they provide to the user.</p><h1>My Role:</h1><p>I took up this project as a solo designer and was responsible for everything in this case study, which includes conducting user research, competitor analysis, UX trials for various wireframes, designing the UI and testing the final designs.</p><p><br></p><p><strong>Duration: 6 weeks (≈ 100 hours)</strong></p><p><strong>Date: 28th January — 6th March, 2021</strong></p><h1>Comparison (Before/After):</h1><p><img src=\"https://miro.medium.com/max/875/1*5XTi3BGGOutkkZpKR7HDEA.png\"></p><h1>Problem:</h1><p>During this event, the majority of the viewers faced the same issue — Not being able to consume and track the utilities, abilities, and ultimate ability for any of the players/agents in the match. It prompted viewers to pay more attention to the casting team and their brilliant commentary.</p><p><br></p><h2>Goal:</h2><p>This project aims to improve the viewer experience for Valorant e-sports by giving them the agent statistics in a much clearer and intuitive way. It also includes researching any other problems and fixing them to overall boost the viewer experience.</p><p><br></p><p><img src=\"https://miro.medium.com/max/875/1*OVxjKEpdME_ucqns1pLbwQ.png\"></p><h2>Current Experience:</h2><p>The following images showcase viewers’ problems after a series of surveys, interviews, and secondary research. Apart from the central issue of not being able to track the statistics of each agent’s abilities, I recognized other problems following a series of user interviews, secondary research in online gaming communities and user surveys.</p><p><br></p><p><strong>Some of the problems with current experience:</strong></p><ol><li>Not being able to track agent abilities, utilities and ultimate ability.</li><li>No clear indication of a player who has achieved his ultimate ability.</li><li>Not being able to recognize which player is the spike carrier.</li><li>No information on which team’s agent has deployed a particular utility (in case each team has similiar agents eg. Killjoy, Cypher )</li><li>No clear distinction between attacking and defending team in scoreboard.</li></ol><p><img src=\"https://miro.medium.com/max/875/1*bMIIDy1ljo70_Fhah6_JVw.png\"></p><h1>Competitor Analysis:</h1><p>Since this was the first event by Valorant, I decided to look at the competitors and see what worked well with the viewers and what didn’t. I looked at events from few of the most popular first-person shooter games.</p><p><br></p><p><img src=\"https://miro.medium.com/max/875/1*MtSc2L2bwLi8wn-SsmJtvA.png\"></p><p>Conducting this analysis gave me an understanding of what viewers are already accustomed to while viewing e-sports events and providing insight into various layouts used by different games.</p><h2>Takeaways:</h2><ol><li>There are two conventional ways stats are structured — either vertically using a sidebar at either side or horizontally, at the top.</li><li>E-Sports aren’t just about the players and the viewers; casters are as crucial as the screens which viewers see. They control the narrative of the matches and micro-events within the games.</li><li>Events stick to the conventional placement of maps and other sections and try not to create a massive difference between player experience and viewer experience of any given game.</li></ol><p><br></p><h1>Wireframes:</h1><p>There are two main micro-events in the actual gameplay — the round phase and the buy phase. These two events make up about 85% of the entire viewing experience apart from Pre-Match events, Agent Selection phase, Post-Match events, to name a few.</p><p><br></p><h2>Trust the Process:</h2><p>While designing the wireframes for the in-round phase, I initially decided to skip low-fidelity wireframes and jump to high-fidelity wireframes instead cause I assumed that e-sports viewers are more accustomed to seeing vibrant colours, and it will be impossible for them to understand what the low-fidelity designs are meant to be.</p><p><br></p><p><strong>This was a huge mistake.</strong></p><p>High-fidelity wireframes are not only time-consuming, in the sense that making many iterations or versions of a single screen is a tedious process, but also making changes to them based on user feedback takes a lot of time.</p><blockquote>Users can usually understand low-fidelity wireframes without having a design background, especially IF the wireframes are well designed. So don’t jump to high-fidelity wireframes, even for user testing.</blockquote><p><br></p><p>What I mean by this is that low-fidelity wireframes not only save time but also test the intuitiveness of the screen. If the wireframes are well designed, the users WILL understand what it is and give you good feedback.</p><h2>Low-Fidelity Wireframes:</h2><p>After wasting three days trying to make high-fidelity wireframes, I finally decided to go with the actual process and create low-fidelity wireframes. The following are the wireframes I designed to get user feedback and decide what to go ahead with.</p><p><br></p><p><img src=\"https://miro.medium.com/max/875/1*WN3G-t4Fxg9OXsvQ9hD0sQ.png\"></p><p><strong>Top-Bar Layout takeaways:</strong></p><p>The horizontal layout at the top is kind of a radical approach. When I tested this wireframe, there were a few concerns from the users:</p><ol><li>It seemed very “top-heavy” with fundamental changes to the layout that people are used to from their player experience.</li><li>The map at the bottom left and kill-feed at the bottom right produces cognitive stress.</li><li>Apart from this, it has a functional error. The huge top-bar reduces visibility when viewing from the player’s POV, which is a considerable detriment especially considering how much Valorant involves verticality aspect in their maps.</li></ol><p><img src=\"https://miro.medium.com/max/875/1*HFStqvaHY9Fxpq_3GEe5_w.png\"></p><p><strong>Side-Bar Layout Takeaways:</strong></p><p>Users were more receptive towards this approach, and it didn’t challenge their previous interactions with Valorant’s First Strike event. There were still a few iterations to be designed to make this side-bar variation a better experience for the viewers, but these were some of the insights:</p><ol><li>Having the stats on the side was highly beneficial as it didn’t hide any part of the actual gameplay. Professional players have an excellent aim positioning so having enemy players on the sides is highly unlikely, making this a better alternative than the top-bar layout.</li><li>The player experience resembled the viewer experience, making for a better visual structure.</li><li>This was also because the majority of the player and the viewer base had come from a single competitor — Counter Strike: Global Offensive.</li></ol><p><br></p><h1>Design Iterations:</h1><p>Following the user feedback and choosing to go ahead with the side-bar layout, I started designing the first screens of the in-round phase and the buy phase.</p><p><br></p><h2>In-Round Phase:</h2><p>The in-round phase screen is undoubtedly the screen that viewers see for the longest time during an e-sports event. For this screen, I made a few variations of both the agent stats and the scoreboard. Below are a few of the variations I came up with. After designing the few variations, I did user interviews and A/B testing to develop the final design.</p><p><br></p><p><img src=\"https://miro.medium.com/max/875/1*172zUZOkHXDIPmGQ1Piyrg.png\"></p><p><strong>Scoreboard Variations Takeaways:</strong></p><p>Testing these variations gave a few insights. Trying to fix a problem and making it evident that you have solved the problem is not always the best way to do things (i.e. in 3rd variation). There has to be a balance between things.</p><p><img src=\"https://miro.medium.com/max/875/1*xhJGosbz3oYCk51SVowe4w.png\"></p><p><strong>Agent Stats Variations Takeaways:</strong></p><p>Giving viewers the exact health and shields’ count seems like a good idea but isn’t as most of the gameplay in professional leagues is a one-shot or two-shot interaction. So if the viewer can see that agent’s health is low, it doesn’t matter if the health is 40 or 78; the player is one-shot away from death for most circumstances.</p><p>Another thing that is usually followed in games is placing the health bar at the bottom, especially in the gameplay. In e-sports, viewers are used to seeing health bars up top, especially when the layout is a sidebar layout rather than a horizontal layout on the top.</p><h2>Complete In-Round design:</h2><p><img src=\"https://miro.medium.com/max/875/1*bm3VxIzeGADO6NJCTRXJTQ.png\"></p><h2>Buy Phase:</h2><p>The buy phase is a 30-sec period between two rounds where teams can buy guns and abilities and plan their course of action for the next round. For a long, most FPS games have been giving the former more importance, and understandably so, as the buy zones in most FPS games are very small, but for Valorant this is a crucial differentiator.</p><p><br></p><blockquote>Valorant provides ridiculously huge buy zones for each team, making the team’s initial player and utility set-up an even more vital element for the match narrative and is still an untapped feature in the viewer’s experience.</blockquote><p><br></p><p>Viewer behaviour in the buy phase suggested, they care about the initial team/utility set-up and want to see that in a much better way than a small map on the top left. Following are a few of the different variations for the buy phase, which can be used on a case-by-case basis. The first two designs should be ideally used for the first 20 secs of the buy phase, and the last design should be used for the last 10 secs to provide player POV once the buy phase has ended.</p><p><img src=\"https://miro.medium.com/max/875/1*HtvaY05bx5zS0OSegzfmgQ.png\"></p><h1>User Testing:</h1><p>Once I designed the above variations, I tested the designs with 10 different users. Following are the details:</p><p><br></p><h2>Goal:</h2><p>To provide users with agent statistics in a much clearer and intuitive way.</p><p><br></p><h2>Test Metrics:</h2><ol><li>Task Completion Rate</li><li>Satisfaction Rate</li><li>Qualitative Feedback</li></ol><h2>Tasks:</h2><ol><li>Find the number of abilities an agent has remaining.</li><li>Find the number of points needed by an agent to unlock the Ultimate.</li><li>Find the agent’s positions at any given time.</li><li>Find the location of the spike carrier at any given time.</li><li>Find the economic value of the team during the buy phase.</li></ol><h2>Results:</h2><p>Overall, my designs increased the average ease of overall task completion rate from&nbsp;<strong>5.1 to 9.2&nbsp;</strong>(1 being hardest, 10 being easiest)<strong>&nbsp;</strong>while enabling viewers with a much more intuitive experience in finding all of the agents’ statistics.</p><p><br></p><p><img src=\"https://miro.medium.com/max/875/1*4Zqdznu77I1K6KdLes-qMA.png\"></p><h1>Additional Designs:</h1><p><img src=\"https://miro.medium.com/max/875/1*PHk5TC9hBH-pcKt85e7jig.png\"></p><h1>Insights Gained:</h1><ol><li>As mentioned earlier, this project gave me one of the biggest learnings I have had until now — TRUST THE PROCESS. All the design processes are time tested, they do work, and trying to go past them based on personal choice can prove detrimental.</li><li>E-Sports is not up-and-coming. It’s already here! The sheer number of hours watched in few months despite being the game’s first official e-sports event is staggering. Giving time and resources to improving these experiences is a necessity.</li><li>Iconography. This was a bit of a surprise. Throughout the design learnings, I have always seen experienced designers talk about icons. It’s always talked about in the context that all icons in the project should look good together, have the same round edges or square edges, and have the same stroke widths. But during this project, I realized the good icons are scalable, they need to convey their value at 16px as well as it does at 96px.</li></ol><p><br></p><h1>What about the Valorant Champions Tour ?</h1><p>I had started and finished this case study 2 weeks before Valorant Challengers Tour had started with its first match. As we know, VCT has shown an improved experience compared to Valorant First Strike, but there are still issues with it, which are addressed by the designs in this case study.</p>",
      "like": 0,
      "status": "verified",
      "createDate": "2022/04/12 15:53:08",
      "_id": {
        "$oid": "6255530cf505e215be0e86d3"
      }
    },
    {
      "title": "Government Petrol Price breaks the Record, Rs 91 Mark in Mumbai",
      "image": "http://127.0.0.1:8000/image/164975918788811.jpeg",
      "path": "src\\public\\image\\164975918788811.jpeg",
      "category": "other",
      "discription": "<p>Diesel and petrol prices set a new record on Monday with Oil Marketing Companies (OMCs) raising rates petrol prices by 24 paise per litre and diesel prices by 32 paise per litre in&nbsp;<a href=\"https://netive.in/?s=mumbai+\" rel=\"noopener noreferrer\" target=\"_blank\">Mumbai</a>, with petrol now selling at Rs 91.08 per litre and diesel for Rs 79.72 / Litre. Fuel prices have been witnessing a steep rise since the past few weeks.</p><p>Petrol prices in the other key cities like Delhi, the petrol and diesel prices were at Rs 83.73 per litre (increase by Rs 0.24) and Rs 75.09 per litre (increase by Rs 0.30), respectively. In Chennai, the petrol price was at Rs 86.80 per litre, while diesel was at Rs 79.08 per litre. In Kolkata, the rates were Rs 85.30 per litre and Rs 76.64 per litre respectively.</p><p>Fuel prices have been on the rise since August 16 after the rupee dipped to its lowest value against the US dollar. The domestic unit hit a record low of 70.32 in early trade that day.</p><p><a href=\"https://www.news18.com/news/india/petrol-price-crosses-rs-91-08-mark-in-mumbai-rates-at-an-all-time-high-1894047.html\" rel=\"noopener noreferrer\" target=\"_blank\">Indian Express</a>&nbsp;published the chat where they show the petrol price&nbsp;<a href=\"https://netive.in/?s=petrol+price\" rel=\"noopener noreferrer\" target=\"_blank\">hike</a>&nbsp;in the last few days,</p><p><img src=\"https://miro.medium.com/max/840/1*HAR7Isi_zuYm9cbeiMCuOQ.png\"></p><p>While the Opposition has blamed the<a href=\"https://netive.in/?s=union+government+\" rel=\"noopener noreferrer\" target=\"_blank\">&nbsp;union government</a>&nbsp;for not doing enough to keep a check on prices, the latter has maintained that global crude oil prices and other international factors are causing a hike in prices of petroleum products.</p>",
      "like": 0,
      "status": "pending",
      "createDate": "2022/04/12 15:56:27",
      "_id": {
        "$oid": "625553d3f505e215be0e8715"
      }
    },
    {
      "title": "A step-by-step guide to building a simple chess AI",
      "image": "http://127.0.0.1:8000/image/164976194140011.jpeg",
      "path": "src\\public\\image\\164976194140011.jpeg",
      "category": "sport",
      "discription": "<p>Let’s explore some basic concepts that will help us create a simple chess AI:</p><ul><li>move-generation</li><li>board evaluation</li><li>minimax</li><li>and alpha beta pruning.</li></ul><p>At each step, we’ll improve our algorithm with one of these time-tested chess-programming techniques. I’ll demonstrate how each affects the algorithm’s playing style.</p><p>You can view the final AI algorithm here on&nbsp;<a href=\"https://github.com/lhartikk/simple-chess-ai\" rel=\"noopener noreferrer\" target=\"_blank\">GitHub</a>.</p><p><br></p><p><br></p><h1>Step 1: Move generation and board visualization</h1><p>We’ll use the&nbsp;<a href=\"https://github.com/jhlywa/chess.js\" rel=\"noopener noreferrer\" target=\"_blank\">chess.js</a>&nbsp;library for move generation, and&nbsp;<a href=\"https://github.com/oakmac/chessboardjs/\" rel=\"noopener noreferrer\" target=\"_blank\">chessboard.js</a>&nbsp;for visualizing the board. The move generation library basically implements all the rules of chess. Based on this, we can calculate all legal moves for a given board state.</p><p><br></p><p><img src=\"https://miro.medium.com/max/875/1*_Z_qtrm9ayf_UhycYudE3g.png\"></p><p>A visualization of the move generation function. The starting position is used as input and the output is all the possible moves from that position.</p><p>Using these libraries will help us focus only on the most interesting task: creating the algorithm that finds the best move.</p><p>We’ll start by creating a function that just returns a random move from all of the possible moves:</p><p><br></p><p><br></p><p>Although this algorithm isn’t a very solid chess player, it’s a good starting point, as we can actually play against it:</p><p><img src=\"https://miro.medium.com/max/513/1*GzOiJRh6Z3FOC3xmPEmKrQ.gif\"></p><p>Black plays random moves. Playable on&nbsp;<a href=\"https://jsfiddle.net/lhartikk/m14epfwb/\" rel=\"noopener noreferrer\" target=\"_blank\">https://jsfiddle.net/lhartikk/m14epfwb/</a>4</p><h1>Step 2 : Position evaluation</h1><p>Now let’s try to understand which side is stronger in a certain position. The simplest way to achieve this is to count the relative strength of the pieces on the board using the following table:</p><p><br></p><p><img src=\"https://miro.medium.com/max/516/1*e4p9BrCzJUdlqx7KVGW9aA.png\"></p><p>With the evaluation function, we’re able to create an algorithm that chooses the move that gives the highest evaluation:</p><p><br></p><p><br></p><p>The only tangible improvement is that our algorithm will now capture a piece if it can.</p><p><img src=\"https://miro.medium.com/max/513/1*fTWDdJ2m3L72X6rqce9_tQ.gif\"></p><p>Black plays with the aid of the simple evaluation function. Playable on&nbsp;<a href=\"https://jsfiddle.net/lhartikk/m5q6fgtb/1/\" rel=\"noopener noreferrer\" target=\"_blank\">https://jsfiddle.net/lhartikk/m5q6fgtb/1/</a></p><h1>Step 3: Search tree using Minimax</h1><p>Next we’re going to create a search tree from which the algorithm can chose the best move. This is done by using the&nbsp;<a href=\"https://en.wikipedia.org/wiki/Minimax\" rel=\"noopener noreferrer\" target=\"_blank\">Minimax</a>&nbsp;algorithm.</p><p><br></p><p>In this algorithm, the recursive tree of all possible moves is explored to a given depth, and the position is evaluated at the ending “leaves” of the tree.</p><p>After that, we return either the smallest or the largest value of the child to the parent node, depending on whether it’s a white or black to move. (That is, we try to either minimize or maximize the outcome at each level.)</p><p><img src=\"https://miro.medium.com/max/875/1*UA5VlNs7s4gl80VknA099w.jpeg\"></p><p>A visualization of the minimax algorithm in an artificial position. The best move for white is&nbsp;b2-c3, because we can guarantee that we can get to a position where the evaluation is&nbsp;-50</p><p><br></p><p><br></p><p>With minimax in place, our algorithm is starting to understand some basic tactics of chess:</p><p><img src=\"https://miro.medium.com/max/495/1*xRfitY19MvJW3ynGKWhQ5A.gif\"></p><p>Minimax with depth level 2. Playable on:&nbsp;<a href=\"https://jsfiddle.net/k96eoq0q/1/\" rel=\"noopener noreferrer\" target=\"_blank\">https://jsfiddle.net/k96eoq0q/1/</a></p><p>The effectiveness of the minimax algorithm is heavily based on the search depth we can achieve. This is something we’ll improve in the following step.</p><h1>Step 4: Alpha-beta pruning</h1><p><a href=\"https://en.wikipedia.org/wiki/Alpha%E2%80%93beta_pruning\" rel=\"noopener noreferrer\" target=\"_blank\">Alpha-beta</a>&nbsp;pruning is an optimization method to the minimax algorithm that allows us to disregard some branches in the search tree.&nbsp;This helps us evaluate the minimax search tree much deeper, while using the same resources.</p><p><br></p><p>The alpha-beta pruning is based on the situation where we can stop evaluating a part of the search tree if we find a move that leads to a worse situation than a previously discovered move.</p><p>The alpha-beta pruning does not influence the outcome of the minimax algorithm — it only makes it faster.</p><p>The alpha-beta algorithm also is more efficient if we happen to visit&nbsp;<strong>first&nbsp;</strong>those paths that lead to good moves.</p><p><img src=\"https://miro.medium.com/max/875/1*96QEzhnsOkNqz7swB0qx8w.jpeg\"></p><p>The positions we do not need to explore if alpha-beta pruning isused and the tree is visited in the described order.</p><p>With alpha-beta, we get a significant boost to the minimax algorithm, as is shown in the following example:</p><p><img src=\"https://miro.medium.com/max/491/1*k3DrkWLNq33ei_t-094qpg.png\"></p><p>The number of positions that are required to evaluate if we want to perform a search with depth of 4 and the “root” position is the one that is shown.</p><p>Follow&nbsp;<a href=\"https://jsfiddle.net/Laa0p1mh/3/\" rel=\"noopener noreferrer\" target=\"_blank\">this link</a>&nbsp;to try the alpha-beta improved version of the chess AI.</p><h1>Step 5: Improved evaluation function</h1><p>The initial evaluation function is quite naive as we only count the material that is found on the board. To improve this, we add to the evaluation a factor that takes in account the position of the pieces. For example, a knight on the center of the board is better (because it has more options and is thus more active) than a knight on the edge of the board.</p><p><br></p><p>We’ll use a slightly adjusted version of piece-square tables that are originally described in the&nbsp;<a href=\"https://chessprogramming.wikispaces.com/Simplified+evaluation+function\" rel=\"noopener noreferrer\" target=\"_blank\">chess-programming-wiki</a>.</p><p><img src=\"https://miro.medium.com/max/875/1*iG6FUYZpU0_RKlqHnC8XxA.png\"></p><p>The visualized piece-square tables visualized. We can decrease or increase the evaluation, depending on the location of the piece.</p><p>With the following improvement, we start to get an algorithm that plays some “decent” chess, at least from the viewpoint of a casual player:</p><p><img src=\"https://miro.medium.com/max/495/1*sX_XwfPrOQ6c62iuVZ75fw.gif\"></p><p>Improved evaluation and alpha-beta pruning with search depth of 3. Playable on&nbsp;<a href=\"https://jsfiddle.net/q76uzxwe/1/\" rel=\"noopener noreferrer\" target=\"_blank\">https://jsfiddle.net/q76uzxwe/1/</a></p><h1>Conclusions</h1><p>The strength of even a simple chess-playing algorithm is that it doesn’t make stupid mistakes. This said, it still lacks strategic understanding.</p><p><br></p><p>With the methods I introduced here, we’ve been able to program a chess-playing-algorithm that can play basic chess. The “AI-part” (move-generation excluded) of the final algorithm is just 200 lines of code, meaning the basic concepts are quite simple to implement. You can check out the final version is on&nbsp;<a href=\"https://github.com/lhartikk/simple-chess-ai\" rel=\"noopener noreferrer\" target=\"_blank\">GitHub</a>.</p><p>Some further improvements we could make to the algorithm would be for instance:</p><ul><li><a href=\"https://chessprogramming.wikispaces.com/Move+Ordering\" rel=\"noopener noreferrer\" target=\"_blank\">move-ordering</a></li><li>faster&nbsp;<a href=\"https://chessprogramming.wikispaces.com/Move+Generation\" rel=\"noopener noreferrer\" target=\"_blank\">move generation</a></li><li>and&nbsp;<a href=\"https://chessprogramming.wikispaces.com/Endgame\" rel=\"noopener noreferrer\" target=\"_blank\">end-game</a>&nbsp;specific evaluation.</li></ul><p>If you want to learn more, check out the&nbsp;<a href=\"https://chessprogramming.wikispaces.com/\" rel=\"noopener noreferrer\" target=\"_blank\">chess programming wiki</a>. It’s a helpful resource for exploring beyond these basic concepts I introduced here.</p><p>Thanks for reading!</p>",
      "like": 0,
      "status": "verified",
      "createDate": "2022/04/12 16:42:21",
      "_id": {
        "$oid": "62555e95f505e215be0e89f1"
      }
    }
  ],
  "__v": 0
},{
  "_id": {
    "$oid": "62553d69d09bc9da6182561e"
  },
  "source_id": {
    "$oid": "62553d0ed09bc9da618255fc"
  },
  "blog": [
    {
      "title": "Are You “Dhonified” Performer When It Comes To Your Business?",
      "image": "http://127.0.0.1:8000/image/16497534496861.png",
      "path": "src\\public\\image\\16497534496861.png",
      "category": "other",
      "discription": "<p><a href=\"https://en.wikipedia.org/wiki/Mahendra_Singh_Dhoni\" rel=\"noopener noreferrer\" target=\"_blank\">M.S. Dhoni</a>&nbsp;doesn’t need any introduction — a star and captain of Indian Cricket team that oozes amazing leadership skills. He is the most successful cricket captain and well-regarded as one of the best leaders the game has witnessed.</p><p>&nbsp;</p><p>Not just Indians but people across the globe go crazy when he comes to the field with that fiery attitude that makes impossible winning possible.</p><p>&nbsp;</p><p>But this post is not about cricket and its relevance but we are surely discussing what makes “<strong>Dhoni</strong>” to give such a superior performance in every match it plays. Here we are learning how an entrepreneur can leverage similar kinds of&nbsp;<strong>“DHONIFIED”</strong>&nbsp;skills to get the maximum and best productivity results in business.</p><p>&nbsp;</p><p>People have attributed success to timings, and luck to the cricket game, but when we do a closer analysis of success you will be able to see M.S.Dhoni’s clear and concise pattern emerging.</p><p>&nbsp;</p><p><strong>Below are top lessons that can be learned from “M.S. Dhoni” captaincy that can give you amazing insights for your business:</strong></p><p>&nbsp;</p><p><strong>His magnetic personality bonds the team</strong></p><p>&nbsp;</p><p>His acceptance to be a natural leader is perhaps his biggest strength. Hailing from the most humble backgrounds always had “down to earth” approach and most importantly he was never shy of expressing himself in the given situation. This behavior led him to earn complete trust in his team members. He has this natural motivational ability that enabled his personality to reinforced self-belief in the team.</p><p>&nbsp;</p><p><strong>Managing pressure</strong></p><p>&nbsp;</p><p>An ability to stay cool and calm with seemingly uncluttered mind is Dhoni’s greatest gift as a leader. This attitude soothes the nerves of other team mates and ensures that all remain focus. How Dhoni manages the pressure during the match without losing composure is the key to long term success and good health.</p><p>&nbsp;</p><p><strong>He dares to take risk and that makes the DIFFERENCE</strong></p><p>&nbsp;</p><p>Strategies whether they are business or game are never full proof. One should be willing to take the risk and M.S. Dhoni is the finest example that has shown us taking risk gets you better. There has to be a strategy planned and one has to play along, taking risk and bit of gambling is always needed to get that competitive edge.</p><p>&nbsp;</p><p><strong>Evokes respect in the rivals</strong></p><p>&nbsp;</p><p>Not all can do modestly and M.S. Dhoni does it. His mere presence, body language and calmness appeal a great amount of respect in the opposite camp. In the business, it takes a great deal to be respected by the competitors — this only comes through better performance and acknowledgement from your external and internal stakeholders.</p><p>&nbsp;</p><p><strong>Stay focus</strong></p><p>&nbsp;</p><p>Dhoni has an ability to insulate himself from his surrounding environment and continue to stay focus on what he is doing. In a corporate context, it is important for the entrepreneurs/businessman to stay focus and positive on the task they are handling and avoid negative energies and distractions.</p><p>&nbsp;</p><p><strong>Managing failure is never easy</strong></p><p>&nbsp;</p><p>There will be always ups and downs — be it is a game or business. Dhoni too has tasted string of embarrassing losses and tell you what it requires a great deal of attitude and character to bounce back.</p><p>&nbsp;</p><p>Dhoni did this in style and countered his critics with his performance. In the business, the failure has to be acknowledged in the same fashion as success and one need to be stay focused to get better every day.</p><p>&nbsp;</p><p>We love watching cricket, in fact cricket is worshipped as a religion in the country but we rarely see the sports person behind making it successful game. We always celebrate the winning but never celebrate the personalities behind them ……it’s high time we start acknowledging their skills which will be amazingly useful in making the business successful.</p>",
      "like": 0,
      "status": "verified",
      "createDate": "2022/04/12 14:20:49",
      "_id": {
        "$oid": "62553d69d09bc9da6182561f"
      }
    },
    {
      "title": "I spent 3 months applying to jobs after a coding bootcamp. Here’s what I learned.",
      "image": "http://127.0.0.1:8000/image/16497535151113.png",
      "path": "src\\public\\image\\16497535151113.png",
      "category": "coding",
      "discription": "<p><strong>A less-talked about part of the bootcamper’s journey is what happens after you graduate — when you’re searching for that six-figure developer position.</strong></p><p><strong>&nbsp;</strong></p><p><br></p><p><strong>I completed Hack Reactor in July 2016 and took almost 3 months before accepting an offer with Radius Intelligence. I applied to 291 companies, did 32 phone screens, 16 technical screens, 13 coding challenges, 11 on-sites, and received 8 offers. The offers ranged from $60-125k in salary from companies all over the US, and for both front end and full stack roles. In total, 2.8% of applications became offers.</strong></p><p><strong>Here are 5 things I wish I’d known before I began my job search.</strong></p><p><br></p><h1><strong>Insight #1: Get through to real people</strong></h1><p><br></p><p><strong>At first, I applied for companies using the shotgun approach. I applied through Indeed.com, AngelList, LinkedIn, StackOverflow, Hacker News, company websites, and even Craigslist.</strong></p><p><strong>I’d submit a resume for any role that wanted React, Node, or JavaScript experience. In the first week, I applied to 15–20 companies a day.</strong></p><p><strong><em>Pro-Tip: Find companies using this&nbsp;</em></strong><a href=\"https://github.com/j-delaney/easy-application\" rel=\"noopener noreferrer\" target=\"_blank\"><strong><em>easy-application repo</em></strong></a><strong><em>.</em></strong></p><p><strong>My yield was low. Less than five percent of companies responded to me. I was throwing applications into a black hole.</strong></p><p><strong>Everything changed when one of my cohort-mates, a former recruiter, shared a guide to the job search. He told us to send emails directly to real people with each application. It could be anybody. As long as someone read it.</strong></p><p><strong>From then on, whenever I submitted an application, I searched for the company on LinkedIn and emailed someone on their engineering or hiring team.</strong></p><p><strong>For most small companies or C-level executives, the email format is usually firstName@dreamCompany.com. For larger companies, it may be firstName.lastName@dreamCompany.com.</strong></p><p><strong>To verify emails, I used&nbsp;</strong><a href=\"https://rapportive.com/\" rel=\"noopener noreferrer\" target=\"_blank\"><strong>Rapportive</strong></a><strong>&nbsp;to cross-check emails with social media accounts.</strong></p><p><strong>The results were amazing. With 150+ emails sent, my response rate was a whopping 22%.</strong></p><p><strong>It also felt great to hear from real people. Surprisingly, CEOs and CTOs responded to me. Sometimes they even interviewed me themselves.</strong></p><p><strong><em>Takeaway: If you’re applying through the front door, make sure you’re getting to human beings.</em></strong></p><p><br></p><p><br></p><h1>Insight #2: Start small and work your way up</h1><p><br></p><p><strong>You will face Level 1 interviews (a non-tech company that needs any dev), where interviewers ask you nothing more than JavaScript trivia.</strong></p><p><strong>You will face Level 9 interviews (Google/Facebook level), where interviewers ask difficult data structure and algorithm questions.</strong></p><p><strong>I strategically set up my process so that I had lower-level interviews earlier, and higher-level interviews later on.</strong></p><p><strong>Early on, I gained experience, built confidence, and secured offers from companies that had less intensive interviews.</strong></p><p><strong>As I got more experience, I effectively “leveled up.” I became capable of completing interviews at companies with higher hiring bars. This is illustrated below as a linear correlation between the number of weeks I was into the process and the base salary I was offered.</strong></p><p><strong>&nbsp;</strong></p><p><br></p><h1><strong>Insight #3: Study like your future job depends on it (because it does)</strong></h1><p><br></p><p><strong>I hate to break it to you, but the most important thing you could be doing at any point is studying and preparing.</strong></p><p><strong>Why? Because you won’t get the offer if you don’t have good answers to the questions they ask you.</strong></p><p><strong>People won’t refer you if they don’t think you’re prepared for their interviews.</strong></p><p><strong>Coming out of Hack Reactor, my weaknesses were data structures and algorithms.&nbsp;</strong><a href=\"http://blog.triplebyte.com/bootcamps-vs-college\" rel=\"noopener noreferrer\" target=\"_blank\"><strong>A study by Triplebyte</strong></a><strong>&nbsp;has found that bootcamp grads are weaker in these areas than computer science grads.</strong></p><p><strong>So I learned and practiced. Every day.</strong></p><p><strong>I devoted entire days to learning sorting algorithms. Other days, I focused on understanding how the internet worked.</strong></p><p><strong>If I didn’t fully understand a concept, I’d spend the day watching YouTube videos or searching StackOverflow until I did.</strong></p><p><strong>I found the following study materials useful:</strong></p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<a href=\"https://www.interviewcake.com/\" rel=\"noopener noreferrer\" target=\"_blank\"><strong>InterviewCake</strong></a><strong>: My favorite resource for data structures and algorithms. It breaks down solutions into step-by-step chunks — a great alternative to Cracking the Code Interview (CTCI). My only gripe is that they don’t have more problems!</strong></p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<a href=\"https://www.hiredintech.com/classrooms/system-design/lesson/60\" rel=\"noopener noreferrer\" target=\"_blank\"><strong>HiredInTech’s System Design Section</strong></a><strong>: A great guide for system design interview questions.</strong></p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<a href=\"https://www.educative.io/collection/5642554087309312/5679846214598656\" rel=\"noopener noreferrer\" target=\"_blank\"><strong>Coderust</strong></a><strong>: If you’re avoiding CTCI like the plague, Coderust 2.0 may be perfect for you. For $49, you get solutions in almost any programming language, with interactive diagrams.</strong></p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<a href=\"https://www.reddit.com/r/cscareerquestions/comments/1jov24/heres_how_to_prepare_for_tech_interviews/\" rel=\"noopener noreferrer\" target=\"_blank\"><strong>Reddit’s How to Prepare for Tech Interviews</strong></a><strong>: I constantly used this as a benchmark for how prepared I was.</strong></p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<a href=\"https://github.com/h5bp/Front-end-Developer-Interview-Questions\" rel=\"noopener noreferrer\" target=\"_blank\"><strong>Front End Interview Questions</strong></a><strong>: An&nbsp;<em>exhaustive</em>&nbsp;list of front-end questions.</strong></p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<a href=\"https://leetcode.com/\" rel=\"noopener noreferrer\" target=\"_blank\"><strong>Leetcode</strong></a><strong>: The go-to resource for algorithm and data structure questions. You can filter by company, so for example, you could get all the questions that Uber or Google typically ask.</strong></p><p><br></p><p><strong>Takeaway: There’s no such thing as too much preparation.</strong></p><p><br></p><h1><strong>Insight #4: Put your best foot forward</strong></h1><p><br></p><p><strong>Breaking into the industry is hard. You have to perform well, even when you’re not fully prepared. In order to succeed, you have to be your own advocate.</strong></p><p><br></p><h2><strong>Sell Yourself</strong></h2><p><br></p><p><strong>At Hack Reactor, we’re trained to mask our inexperience. In our personal narratives, we purposely omit our bootcamp education.</strong></p><p><strong>Why? Otherwise, companies automatically categorize us into junior developer roles or tag us as “not enough experience.”</strong></p><p><strong>In one interview with a startup, the interview immediately went south once they realized I’d done a bootcamp. One company used it against me and made me a $60k offer, benchmarking against junior developers.</strong></p><p><strong>Ultimately, you need to convince companies that you can do the job.</strong></p><p><strong>At the same time, you need to convince&nbsp;<em>yourself</em>&nbsp;that you can do the job.</strong></p><p><strong>You can. Focus on your love for programming. Focus on what you’ve built with React and Node. Focus on demonstrating your deep knowledge in JavaScript and any other languages you’ve learned.</strong></p><p><strong>Only then can they justify giving you the job.</strong></p><p><br></p><h2><strong>It’s a Two-way Conversation</strong></h2><p><br></p><p><strong>Interviewing is a mutual exploration of fit between an employee and an employer. While it’s your job to convince employers to hire you, it’s also their job to win you over.</strong></p><p><strong>Don’t be ashamed of using the interview as an opportunity to evaluate the job opportunity.</strong></p><p><strong>I talked to any company, even if I had only the slightest interest.</strong></p><p><strong>I did on-sites all over the country with any company that invited me out. I asked questions, and sucked up knowledge on engineering team organization, technologies and tools used, company challenges, and system architecture.</strong></p><p><strong><em>Pro-Tip: During interviews, ask the following questions:</em></strong></p><p><strong><em>What are some technical challenges you’ve recently faced?</em></strong></p><p><strong><em>What do you enjoy about working at X company?</em></strong></p><p><strong><em>How are teams structured and how are tasks usually divided?</em></strong></p><p><strong>I treated every interaction as a learning opportunity. Each interaction helped me improve my presentation, interview, and technical skills. Each failure helped me find my blind spots.</strong></p>",
      "like": 0,
      "status": "verified",
      "createDate": "2022/04/12 14:21:55",
      "_id": {
        "$oid": "62553dabd09bc9da6182562c"
      }
    },
    {
      "title": "IPL 2022: Ranking all teams based on their strongest playing XIs",
      "image": "http://127.0.0.1:8000/image/16497537792441.jpg",
      "path": "src\\public\\image\\16497537792441.jpg",
      "category": "sport",
      "discription": "<p>The participating teams have their squads ready now to set the tournament on fire. The mega&nbsp;<strong>Indian Premier League (IPL)</strong>&nbsp;auction was good for all the teams, and all of them looked satisfied with the resources they got. Only 204 out of 590 players in the auction managed to get contracts. The teams had varied strategies, and it remains to be seen which one was effective.</p><p>The teams will find it difficult to put across their playing XIs as they will have a problem of plenty. All of the teams have a huge amount of talent. The teams will have to make tough calls while selecting their first-choice XI. Who sits on the bench? It can be a hard thing to crack.</p><p>The competition is going to be more thrilling, as two brand new teams are set to be part of the 15th edition of the IPL. A quality playing XI of an IPL team forms with the combination of good domestic Indian players, and established international cricket stars.</p><h1>Here we rank the 10 IPL 2022 teams based on their strongest playing XIs:</h1><h1>10. Gujarat Titans</h1><p><img src=\"https://miro.medium.com/max/800/0*FdRUgA4_A3cphglj.jpg\"></p><p>It will be fair to say that the Titans could have done better at the auction. At times, they looked clueless while bidding. Till the last session of the auction, they did not have a single wicket-keeper. They went for Matthew Wade and Wriddhiman Saha in the dying moments of the event. It will be very interesting to see who opens with Shubman Gill, as Jason Roy has opted out from the season.</p><p>After his exclusion, Matthew Wade is expected to open the innings with Shubman Gill who can double up his role by keeping the wickets. They can try someone like Abhinav Manohar at number three as they don’t have many options. The Indian all-rounder Vijay Shankar will probably be the one to take up the number four batting position.</p><p>The South African star David Miller can be seen finishing games at number five, with skipper&nbsp;<strong>Hardik Pandya</strong>&nbsp;at number six. Rahul Tewatia can be a trump card for them down the order. Rashid Khan is expected to be the most valuable player for them, and he can be partnered by Rahul Tewatia in the spin bowling department. Mohammed Shami, Lockie Ferguson, and Pradeep Sangwan will probably form the pack attack.</p><h1>9. Sunrisers Hyderabad</h1><p><img src=\"https://miro.medium.com/max/800/0*fPc_wS6QznG5jQzL.jpg\"></p><p>The Hyderabad-based franchise had the most surprising retention ahead of the auction. Their decision of letting David Warner and Rashid Khan go was surprising, to say the least. They have tried to form their line-up around&nbsp;<strong>Kane Williamson</strong>, who will lead the team. Hyderabad started their bidding quite late at the auction as they were seen backing their previous players.</p><p>They have successfully bought Rahul Tripathi, who is expected to be their first-choice opener in the tournament. The skipper can be seen opening alongside him. Aiden Markram has done well for South Africa batting at number three, and we can see him doing the same for the Sunrisers. SRH spent a lot of money on in-form Nicholas Pooran, who will undoubtedly be their most dependable batter in the middle-order.</p><p>The young all-rounders Abdul Samad and Abhishek Sharma will have the responsibility of finishing games for them at number five and six. The latest West Indian sensation Romario Shephard can be seen batting at number seven for them. Washington Sundar will have a big role to play for the franchise, too. He will be partnered by Shreyas Gopal during the spin-bowling at the middle overs. Bhuvi and Natarajan are their first-choice pacers.</p><h1>8. Kolkata Knight Riders</h1><p><img src=\"https://miro.medium.com/max/800/0*sW5dCEEy6d48T_8h.jpg\"></p><p>The Kolkata Knight Riders had a relief on their faces when they purchased&nbsp;<strong>Shreyas Iyer</strong>, as they desperately needed a solid skipper. The Indian batter has been named the skipper of the KKR for the 2022 season. They retained Andre Russell, Sunil Narine, Venkatesh Iyer, and Varun Chakravarthy, ahead of the mega auction.</p><p>Venkatesh Iyer did well while opening during the second leg of the previous season. He can get an opening partner in the form of Aaron Finch. The skipper Shreyas Iyer has shown a quality display of batting at number three for India recently. Nitish Rana will have the responsibility of their middle-order, alongside someone like Sheldon Jackson who has the dual ability to keep wickets.</p><p>Andre Russell will continue his role of finishing games for KKR in 2022, too. Sunil Narine will probably bat at number seven and will be one of KKR’s strongest pillars of bowling. Pat Cummins, Shivam Mavi, and Umesh Yadav can form the pace battery. Varun Chakravarthy will partner Sunil Narine as a spin bowler.</p><h1>7. Rajasthan Royals</h1><p><img src=\"https://miro.medium.com/max/800/0*DBqyXwMSSYxQrZGf.jpg\"></p><p>Rajasthan Royals also had a decent auction. Their problem now is that they have a lot of top-order batters. As a result, it can be tricky for the management to select three or four of them. Sanju Samson will lead the team this season, too, and Rajasthan will have a lot of hopes from him as a batter. On the other hand, they have a good-looking bowling line-up.</p><p>Rajasthan retained Yashasvi Jaiswal before the auction and he will be the contender to open the batting for them with Buttler. Devdutt Padikkal might not get his favorite batting position and rather he can be seen batting at number three. The skipper&nbsp;<strong>Sanju Samson</strong>&nbsp;can be seen thrashing the bowlers at number four.</p><p>Shimron Hetmyer and Riyan Parag will be the best option for them at their lower-middle order. James Neesham will provide his multi-dimensional services to the Royals. Ashwin and Yuzi Chahal will handle the spin attack. Trent Boult’s performances will be crucial for them, as he is expected to lead their pace attack with Prasidh Krishna as a quality partner.</p><h1>6. Punjab Kings</h1><p><img src=\"https://miro.medium.com/max/800/0*pUlLDbfRhbbLD_w6.jpg\"></p><p>Punjab Kings was the franchise with the least number of retentions. They retained Mayank Agarwal and Arshdeep Singh. Just like every season, PBKS was looking to build a fresh and new team in 2022, too. Punjab went to the auction with the biggest purse, and they were quite busy while bidding for the players at the event. They have successfully assembled a decent squad.</p><p>Mayank Agarwal has got a nice opening partner in the form of&nbsp;<strong>Shikhar Dhawan</strong>. The hard-hitting English batter, Jonny Bairstow, and Liam Livingstone will take the charge of Punjab’s middle-order. The addition of these two stars is a blessing for the franchise.</p><p>The hero of the recently concluded U19 World Cup, Raj Bawa, has been bought by the Punjab-based franchise and will be seen batting for them at the middle-order. Shahrukh Khan was one of the most expensive uncapped players, who will be seen as a finisher for the franchise. Odean Smith, Kagiso Rabada, and Arshdeep Singh can take charge of fast-bowling, while spin-bowling can be taken care of by Harpreet Brar and Rahul Chahar.</p><h1>5. Mumbai Indians</h1><p><img src=\"https://miro.medium.com/max/800/0*QI4exypYGLJKN9Y9.jpg\"></p><p>The most successful team in the history of IPL spent more than 10 crores on a single player for the first time in the auction. They went berserk while picking Ishan Kishan. MI has been a franchise that has backed its core. They invest in their familiar faces and build a team around them. Despite the Pandya brothers’ departure from the team, they still look very good.</p><p>The skipper Rohit Sharma is one of the best openers in the shortest format, and this time the pocket-size dynamo Ishan Kishan can accompany him who is a dependable gloveman, too. Suryakumar Yadav has been MI’s number three for a good time now, and his role will not be different from other seasons. Mumbai can use Tilak Verma as their number four who is a promising player.</p><p>The T20 star from Singapore, Tim David, can be seen finishing games for MI, alongside veteran&nbsp;<strong>Kieron Pollard</strong>. Daniel Sams is a good player to have in the team due to his all-round abilities as a cricketer. Jasprit Bumrah will lead the pace attack of MI, finding good support from Jaydev Unadkat and Tymal Mills. MI have got Mayank Markande as a quality leg-spinner who has done well for them previously.</p><h1>4. Royal Challengers Bangalore</h1><p><img src=\"https://miro.medium.com/max/800/0*7_D0bp_WJVr71fJF.jpg\"></p><p>The IPL franchise with the biggest fan base has not done many wonders in the Indian Premier League. The franchise will not be the same anymore as&nbsp;<strong>AB de Villers</strong>&nbsp;has decided to take retirement from all forms of the game, and their skipper Virat Kohli has decided to quit captaincy. RCB have announced that Faf du Plessis will lead the franchise this season.</p><p>Faf can be seen opening the innings for RCB, alongside Virat Kohli. RCB can think a little bit out-of-the-box while selecting their number three. They can go for someone like Shahbaz Ahmad. The star performer for RCB last season, Glenn Maxwell, will take charge of RCB’s middle-order. RCB have roped in the experienced Indian wicket-keeper, Dinesh Karthik, and sending him at number five can be a good move.</p><p>Mahipal Lomror is a gun cricketer and RCB can invest in him as their go-to all-rounder. They have spent a huge amount of money on Wanindu Hasaranga who is all set to set the stage on fire. Harshal Patel and Mohammed Siraj can gel up with Josh Hazlewood, and form a good fast-bowling line-up. Yuzvendra Chahal is not with RCB anymore. Hence, Karn Sharma can be a good replacement for him.</p><h1>3. Chennai Super Kings</h1><p><img src=\"https://miro.medium.com/max/800/0*tGjWnutjGwT6LQeq.jpg\"></p><p>Chennai Super Kings has a good mixture of experienced and young guys in their squad. They have this time has picked some young, budding cricketers who can serve the franchise for many more seasons. The big news is that Suresh Raina has not been picked by CSK, which was a surprising decision by the franchise.</p><p>Ruturaj Gaikwad has lost his opening partner Faf du Plessis but CSK have picked a good option in Devon Conway. Moeen Ali batted at number three for CSK last season, and did well so they can think of giving him a long run. Robin Uthappa did well for CSK in their last few games when he was given the number four batting position. Ambati Rayudu has been a star for CSK and he will continue doing his duty.</p><p>The face of CSK,&nbsp;<strong>MS Dhoni</strong>, will continue his role which he has been doing since 2008. The MVP of CSK, Ravindra Jadeja, has evolved as a batter, and there never was a doubt about his bowling. Jadeja will be the most important player for CSK. With Deepak Chahar getting injured, we can see someone like Tushar Deshpande and KM Asif replacing him in the first few matches in his absence. Bravo and Milne can be the first-choice pacers with a good spin option in the form of Santner.</p><h1>2. Delhi Capitals</h1><p><img src=\"https://miro.medium.com/max/800/0*KXXquNCo578849vr.jpg\"></p><p>Delhi Capitals were the busiest franchise at the mega auction. They sealed some quality deals at the event.&nbsp;<strong>Rishabh Pant</strong>&nbsp;did well captaining Delhi last year, and will continue doing the same thing in 2022 too. DC have some stand-out match-winners of the 20-over format, and they have successfully assembled one of the strongest squads.</p><p>The most surprising deal of the IPL 2022 mega auction was of David Warner. Warner will probably be the new opening partner of Prithvi Shaw, and that duo can be a big threat for the opposition. KS Bharat had some good outings for RCB last year, and they can use him as their number three. The skipper Rishabh Pant can be seen batting at number four.</p><p>They can go for Mitchell Marsh at number five as he has done well for Australia, as well as his BBL franchise Perth Scorchers batting up the order He can also bat at three as he did for Australia in the T20 World Cup. Rovman Powell can be given the responsibility of finishing the games for them. Axar Patel can be a dependable number seven. Shardul, Nortje, and Sakariya can be the first-choice pacers. Kuldeep Yadav can have a breakthrough season in 2022, as he is expected to get a long run from the Delhi-based franchise.</p><h1>1. Lucknow Super Giants</h1><p><img src=\"https://miro.medium.com/max/800/0*8eH72cdjdPTs8iig.jpg\"></p><p>It will not be any wrong to say that the Lucknow Super Giants have managed to get the best-looking squad among all the teams. The Lucknow-based franchise is taking part for the first time, and is expected to do well in their inaugural season. They have named&nbsp;<strong>KL Rahul</strong>&nbsp;as their captain for the season, who was a draft pick alongside Marcus Stoinis and Ravi Bishnoi.</p><p>KL Rahul has been the most consistent batter in the last few editions of the league. KL is expected to open the innings for LSG alongside Quinton de Kock who is one of the best wicket-keepers in world cricket, and he will be the first-choice keeper for LSG. They have managed to get Manish Pandey who is a quality number three batter. At number four, they have someone like Deepak Hooda who is an all-rounder with a lot of promise.</p><p>The main strength of LSG is their all-rounders. They have Marcus Stoinis, Jason Holder, and Krunal Pandya who can be their number five, six, and seven respectively. At number eight, they again have a good all-rounder in the form of Krishnappa Gowtham. After that, they have Avesh Khan who was extraordinary in 2021.</p><p>With Mark Wood injured, Chameera is expected to partner Avesh. The icing on the cake is Ravi Bishnoi who can deceive most of the batters in the tournament.</p>",
      "like": 0,
      "status": "verified",
      "createDate": "2022/04/12 14:26:19",
      "_id": {
        "$oid": "62553eb3d09bc9da61825688"
      }
    }
  ],
  "__v": 0
},{
  "_id": {
    "$oid": "62553f83d09bc9da618256df"
  },
  "source_id": {
    "$oid": "62553f33d09bc9da618256bd"
  },
  "blog": [
    {
      "title": "Evolving the Facebook News Feed to Serve You Better",
      "image": "http://127.0.0.1:8000/image/16497539876082.jpeg",
      "path": "src\\public\\image\\16497539876082.jpeg",
      "category": "news",
      "discription": "<p>Starting late last year, we set out to explore how we could make News Feed more readable, conversational, and easier to navigate. As you might imagine, designing for a community that connects two billion people can pose some unique challenges.</p><p>As managers of two teams of designers that bring News Feed to life each day, we are sensitive to the fact that any changes we make can resonate across the entire Facebook experience. In speaking with people who use Facebook around the world, we’ve heard that they felt News Feed had become cluttered and hard to navigate. Solving this problem meant evolving the News Feed design system, a significant challenge for a highly-optimized product.&nbsp;Small changes, like a few extra pixels of padding or the tint of a button, can have large and unexpected repercussions.</p><h2>Improving readability on News Feed</h2><p>Our design and research teams are in continuing dialog with real users, every day. Consistently, our audience lets us know what they care about most:</p><p>1.&nbsp;&nbsp;&nbsp;&nbsp;The&nbsp;<strong>content</strong>&nbsp;itself, such as a shared photo</p><p>2.&nbsp;&nbsp;The person&nbsp;<strong>who&nbsp;</strong>is sharing the content</p><p>3.&nbsp;&nbsp;&nbsp;How they can leave&nbsp;<strong>feedback</strong>&nbsp;(like a comment or reaction) to what they were seeing</p><p>With feedback from real users in mind, we took a look at the anatomy of our most common story types. The idea was to break things down into their atomic parts, and make certain the design choices we’d made in the past served the needs of our audience right now.</p><p>We asked ourselves if we were meeting three key objectives:</p><p><em>How might we improve News Feed to be easier to read and distinguish key areas of content?</em></p><p><em>How might we make the content itself more engaging and immersive?</em></p><p><em>How might we make it easier to leave feedback?</em></p><p>These questions drove our exploration and experimentation in a design sprint, a week of coordinated brainstorming and prototyping of new ideas, across two teams of designers, researchers and content strategists. The sprint artifacts helped shape what became a north star for the future of News Feed.</p>",
      "like": 0,
      "status": "verified",
      "createDate": "2022/04/12 14:29:47",
      "_id": {
        "$oid": "62553f83d09bc9da618256e0"
      }
    },
    {
      "title": "The Uneven Landscape Of The Fantasy Sports Industry Is About To Be Reshaped",
      "image": "http://127.0.0.1:8000/image/16497540178292.jpeg",
      "path": "src\\public\\image\\16497540178292.jpeg",
      "category": "sport",
      "discription": "<p>The fantasy sports industry is ripe and growing, yet simultaneously ready for disruption. It is largely dominated by a pair of competing giants, FanDuel and DraftKings, which host daily fantasy sports leagues across a wide variety of athletic pursuits. Between the two of them, they occupy almost 90% of this $7 billion market. The remainder is filled out by Yahoo Fantasy and smaller companies around the world.</p><p>&nbsp;</p><p>We are happy to be one of these smaller companies active in the space because we are building something to change the status quo of the industry. Even though FanDuel and DraftKings sit at the head of the table with more than $1 billion in funding between them, there are a variety of pain points associated with playing on their platforms. But MyDFS has solved these problems by implementing something our competitors haven’t:&nbsp;<a href=\"https://medium.com/@mydfs/the-blockchain-is-going-to-change-fantasy-sports-forever-1910987ce105\" rel=\"noopener noreferrer\" target=\"_blank\">blockchain technology</a>.</p><p>&nbsp;</p><p>There were 60 million fantasy players in the United States and Canada in 2017. Most of them played on FanDuel and DraftKings despite the platforms’ uncertain legal statuses, lengthy user verifications, inconvenient payouts of winnings, and complicated user interfaces. We built MyDFS not to compete with industry leaders, but to redefine the industry itself.</p><p>&nbsp;</p><p>MyDFS is powered by the same technology that enables popular cryptocurrencies like bitcoin. This means it works in a secure, transparent manner, everywhere in the world. The industry leaders look like dinosaurs by comparison.</p><p>&nbsp;</p><p>Regular users of these leading platforms are surely familiar with the red tape associated with receiving your fantasy sports winnings. Checks can take two weeks to process and arrive in the mail. You have to prove your identity with a picture of your driver’s license, or other ID paperwork. Furthermore, you may not even be allowed to play depending on where you live — there is no clear mandate on whether or not fantasy sports is a game of skill or if it’s just gambling.</p><p>&nbsp;</p><p>Add to this that the industry leaders have been widely accused of&nbsp;<a href=\"https://deadspin.com/draftkings-employee-with-access-to-inside-info-wins-35-1734719747\" rel=\"noopener noreferrer\" target=\"_blank\">insider gaming</a>, and the need for a transparent system built on fair play becomes even clearer. This is why MyDFS will thrive in an industry that is still growing: blockchain technology eliminates all of the problems that plague the major platforms. MyDFS works everywhere in the world, sends payouts to winners instantly, and only requires a cryptocurrency wallet and email address as ID confirmation.</p><p>&nbsp;</p><p>All data pertaining to games and athletes is stored and verified in the blockchain. This means that anyone who wants to see the data that was used to determine a result can easily do so — all this data is publicly accessible on our platform, preserving fair play.</p><p>&nbsp;</p><p>The average fantasy player spent $556 on fantasy games in 2017. Now that we’ve significantly improved the gaming experience beyond what industry leaders can provide, we expect they’ll be spending a meaningful portion of that money to play on MyDFS.</p><p>&nbsp;</p><p>We’ll be unveiling our blockchain-enabled daily fantasy sports platform leading up to the World Cup in Russia this June. If you’d like to own a small part of what we’re working on, you can&nbsp;<a href=\"https://medium.com/@mydfs/would-you-like-to-own-a-piece-of-the-future-of-fantasy-sports-a056e48950b4\" rel=\"noopener noreferrer\" target=\"_blank\">invest in our ICO</a>&nbsp;to get some tokens for use in entering MyDFS leagues. As more users join the platform and buy their own tokens, our token value will grow. If you like the sound of MyDFS, then it’s in your interest to get tokens sooner instead of later.</p>",
      "like": 0,
      "status": "verified",
      "createDate": "2022/04/12 14:30:17",
      "_id": {
        "$oid": "62553fa1d09bc9da618256ed"
      }
    },
    {
      "title": "A step-by-step guide to building a simple chess AI",
      "image": "http://127.0.0.1:8000/image/164975416512711.jpeg",
      "path": "src\\public\\image\\164975416512711.jpeg",
      "category": "sport",
      "discription": "<p>Let’s explore some basic concepts that will help us create a simple chess AI:</p><ul><li>move-generation</li><li>board evaluation</li><li>minimax</li><li>and alpha beta pruning.</li></ul><p>At each step, we’ll improve our algorithm with one of these time-tested chess-programming techniques. I’ll demonstrate how each affects the algorithm’s playing style.</p><p>You can view the final AI algorithm here on&nbsp;<a href=\"https://github.com/lhartikk/simple-chess-ai\" rel=\"noopener noreferrer\" target=\"_blank\">GitHub</a>.</p><p><br></p><p><br></p><h1>Step 1: Move generation and board visualization</h1><p>We’ll use the&nbsp;<a href=\"https://github.com/jhlywa/chess.js\" rel=\"noopener noreferrer\" target=\"_blank\">chess.js</a>&nbsp;library for move generation, and&nbsp;<a href=\"https://github.com/oakmac/chessboardjs/\" rel=\"noopener noreferrer\" target=\"_blank\">chessboard.js</a>&nbsp;for visualizing the board. The move generation library basically implements all the rules of chess. Based on this, we can calculate all legal moves for a given board state.</p><p><br></p><p><img src=\"https://miro.medium.com/max/875/1*_Z_qtrm9ayf_UhycYudE3g.png\"></p><p>A visualization of the move generation function. The starting position is used as input and the output is all the possible moves from that position.</p><p>Using these libraries will help us focus only on the most interesting task: creating the algorithm that finds the best move.</p><p>We’ll start by creating a function that just returns a random move from all of the possible moves:</p><p><br></p><p><br></p><p>Although this algorithm isn’t a very solid chess player, it’s a good starting point, as we can actually play against it:</p><p><img src=\"https://miro.medium.com/max/513/1*GzOiJRh6Z3FOC3xmPEmKrQ.gif\"></p><p>Black plays random moves. Playable on&nbsp;<a href=\"https://jsfiddle.net/lhartikk/m14epfwb/\" rel=\"noopener noreferrer\" target=\"_blank\">https://jsfiddle.net/lhartikk/m14epfwb/</a>4</p><h1>Step 2 : Position evaluation</h1><p>Now let’s try to understand which side is stronger in a certain position. The simplest way to achieve this is to count the relative strength of the pieces on the board using the following table:</p><p><br></p><p><img src=\"https://miro.medium.com/max/516/1*e4p9BrCzJUdlqx7KVGW9aA.png\"></p><p>With the evaluation function, we’re able to create an algorithm that chooses the move that gives the highest evaluation:</p><p><br></p><p><br></p><p>The only tangible improvement is that our algorithm will now capture a piece if it can.</p><p><img src=\"https://miro.medium.com/max/513/1*fTWDdJ2m3L72X6rqce9_tQ.gif\"></p><p>Black plays with the aid of the simple evaluation function. Playable on&nbsp;<a href=\"https://jsfiddle.net/lhartikk/m5q6fgtb/1/\" rel=\"noopener noreferrer\" target=\"_blank\">https://jsfiddle.net/lhartikk/m5q6fgtb/1/</a></p><h1>Step 3: Search tree using Minimax</h1><p>Next we’re going to create a search tree from which the algorithm can chose the best move. This is done by using the&nbsp;<a href=\"https://en.wikipedia.org/wiki/Minimax\" rel=\"noopener noreferrer\" target=\"_blank\">Minimax</a>&nbsp;algorithm.</p><p><br></p><p>In this algorithm, the recursive tree of all possible moves is explored to a given depth, and the position is evaluated at the ending “leaves” of the tree.</p><p>After that, we return either the smallest or the largest value of the child to the parent node, depending on whether it’s a white or black to move. (That is, we try to either minimize or maximize the outcome at each level.)</p><p><img src=\"https://miro.medium.com/max/875/1*UA5VlNs7s4gl80VknA099w.jpeg\"></p><p>A visualization of the minimax algorithm in an artificial position. The best move for white is&nbsp;b2-c3, because we can guarantee that we can get to a position where the evaluation is&nbsp;-50</p><p><br></p><p><br></p><p>With minimax in place, our algorithm is starting to understand some basic tactics of chess:</p><p><img src=\"https://miro.medium.com/max/495/1*xRfitY19MvJW3ynGKWhQ5A.gif\"></p><p>Minimax with depth level 2. Playable on:&nbsp;<a href=\"https://jsfiddle.net/k96eoq0q/1/\" rel=\"noopener noreferrer\" target=\"_blank\">https://jsfiddle.net/k96eoq0q/1/</a></p><p>The effectiveness of the minimax algorithm is heavily based on the search depth we can achieve. This is something we’ll improve in the following step.</p><h1>Step 4: Alpha-beta pruning</h1><p><a href=\"https://en.wikipedia.org/wiki/Alpha%E2%80%93beta_pruning\" rel=\"noopener noreferrer\" target=\"_blank\">Alpha-beta</a>&nbsp;pruning is an optimization method to the minimax algorithm that allows us to disregard some branches in the search tree.&nbsp;This helps us evaluate the minimax search tree much deeper, while using the same resources.</p><p><br></p><p>The alpha-beta pruning is based on the situation where we can stop evaluating a part of the search tree if we find a move that leads to a worse situation than a previously discovered move.</p><p>The alpha-beta pruning does not influence the outcome of the minimax algorithm — it only makes it faster.</p><p>The alpha-beta algorithm also is more efficient if we happen to visit&nbsp;<strong>first&nbsp;</strong>those paths that lead to good moves.</p><p><img src=\"https://miro.medium.com/max/875/1*96QEzhnsOkNqz7swB0qx8w.jpeg\"></p><p>The positions we do not need to explore if alpha-beta pruning isused and the tree is visited in the described order.</p><p>With alpha-beta, we get a significant boost to the minimax algorithm, as is shown in the following example:</p><p><img src=\"https://miro.medium.com/max/491/1*k3DrkWLNq33ei_t-094qpg.png\"></p><p>The number of positions that are required to evaluate if we want to perform a search with depth of 4 and the “root” position is the one that is shown.</p><p>Follow&nbsp;<a href=\"https://jsfiddle.net/Laa0p1mh/3/\" rel=\"noopener noreferrer\" target=\"_blank\">this link</a>&nbsp;to try the alpha-beta improved version of the chess AI.</p><h1>Step 5: Improved evaluation function</h1><p>The initial evaluation function is quite naive as we only count the material that is found on the board. To improve this, we add to the evaluation a factor that takes in account the position of the pieces. For example, a knight on the center of the board is better (because it has more options and is thus more active) than a knight on the edge of the board.</p><p><br></p><p>We’ll use a slightly adjusted version of piece-square tables that are originally described in the&nbsp;<a href=\"https://chessprogramming.wikispaces.com/Simplified+evaluation+function\" rel=\"noopener noreferrer\" target=\"_blank\">chess-programming-wiki</a>.</p><p><img src=\"https://miro.medium.com/max/875/1*iG6FUYZpU0_RKlqHnC8XxA.png\"></p><p>The visualized piece-square tables visualized. We can decrease or increase the evaluation, depending on the location of the piece.</p><p>With the following improvement, we start to get an algorithm that plays some “decent” chess, at least from the viewpoint of a casual player:</p><p><img src=\"https://miro.medium.com/max/495/1*sX_XwfPrOQ6c62iuVZ75fw.gif\"></p><p>Improved evaluation and alpha-beta pruning with search depth of 3. Playable on&nbsp;<a href=\"https://jsfiddle.net/q76uzxwe/1/\" rel=\"noopener noreferrer\" target=\"_blank\">https://jsfiddle.net/q76uzxwe/1/</a></p><h1>Conclusions</h1><p>The strength of even a simple chess-playing algorithm is that it doesn’t make stupid mistakes. This said, it still lacks strategic understanding.</p><p><br></p><p>With the methods I introduced here, we’ve been able to program a chess-playing-algorithm that can play basic chess. The “AI-part” (move-generation excluded) of the final algorithm is just 200 lines of code, meaning the basic concepts are quite simple to implement. You can check out the final version is on&nbsp;<a href=\"https://github.com/lhartikk/simple-chess-ai\" rel=\"noopener noreferrer\" target=\"_blank\">GitHub</a>.</p><p>Some further improvements we could make to the algorithm would be for instance:</p><ul><li><a href=\"https://chessprogramming.wikispaces.com/Move+Ordering\" rel=\"noopener noreferrer\" target=\"_blank\">move-ordering</a></li><li>faster&nbsp;<a href=\"https://chessprogramming.wikispaces.com/Move+Generation\" rel=\"noopener noreferrer\" target=\"_blank\">move generation</a></li><li>and&nbsp;<a href=\"https://chessprogramming.wikispaces.com/Endgame\" rel=\"noopener noreferrer\" target=\"_blank\">end-game</a>&nbsp;specific evaluation.</li></ul><p>If you want to learn more, check out the&nbsp;<a href=\"https://chessprogramming.wikispaces.com/\" rel=\"noopener noreferrer\" target=\"_blank\">chess programming wiki</a>. It’s a helpful resource for exploring beyond these basic concepts I introduced here.</p><p>Thanks for reading!</p>",
      "like": 0,
      "status": "verified",
      "createDate": "2022/04/12 14:32:45",
      "_id": {
        "$oid": "62554035d09bc9da618256ff"
      }
    }
  ],
  "__v": 0
},{
  "_id": {
    "$oid": "6255464dd09bc9da61825795"
  },
  "source_id": {
    "$oid": "625540b1d09bc9da61825728"
  },
  "blog": [
    {
      "title": "Why Everyone Should Watch Less News How To Read More Books — A Lot More",
      "image": "http://127.0.0.1:8000/image/16497557252653.jpeg",
      "path": "src\\public\\image\\16497557252653.jpeg",
      "category": "news",
      "discription": "<p>When you read a lot of books people inevitably assume you speed read. In fact, that’s probably the most common email I get. They want to know my trick for reading so fast. They see all the&nbsp;<a href=\"https://ryanholiday.net/reading-newsletter/\" rel=\"noopener noreferrer\" target=\"_blank\">books I recommend every month</a>&nbsp;in my reading newsletter and assume I must have some secret. So they ask me to teach them how to speed read.</p><p>That’s when I tell them I don’t have a secret. Even though I read hundreds of books every single year, I actually read quite slow. In fact, I read deliberately slow,&nbsp;<a href=\"http://thoughtcatalog.com/2013/read-to-lead-how-to-digest-books-above-your-level/\" rel=\"noopener noreferrer\" target=\"_blank\">so that I can take notes (and then whenever I finish a book, I go back through and transcribe these notes</a>&nbsp;for my version of a&nbsp;<a href=\"http://thoughtcatalog.com/2013/how-and-why-to-keep-a-commonplace-book/\" rel=\"noopener noreferrer\" target=\"_blank\">commonplace book</a>.</p><p>So where do I get the time? (Well for starters I don’t waste any of it asking dumb questions).</p><p>Look, where do you get the time to eat three meals a day? How do you have time to do all that sleeping? How do you manage to spend all those hours with your kids or wife or a girlfriend or boyfriend?</p><p>You don’t get that time anywhere, do you? You just make it because it’s really important. It’s a non-negotiable part of your life.</p><p>I think there are three main barriers that hold people back from making this happen and I want to disassemble them right now so you can start reading way, way more.</p><h1>Time</h1><p>The key to reading lots of book begins with stop thinking of it as some activity that you do. Reading must become as natural as eating and breathing to you. It’s not something you do because you feel like it, but because it’s a reflex, a default.</p><p>Carry a book with you at all times. Every time you get a second, crack it open. Don’t install games on your phone–that’s time you could be reading. When you’re eating, read. When you’re on the train, in the waiting room, at the office–read. It’s work, really important work. Don’t let anyone ever let you feel like it’s not.</p><p>Do you know how much time you waste during the day? Conference calls, meetings, TV shows that you don’t really like but watch anyway. Well, if you can make time for that you can make time for reading. (Or better, just swap those activities for books)</p><h1>Money</h1><p>If I had to steal books to support my reading habit, I would. Thankfully you can buy some of the best literature ever published for pennies on Amazon.</p><p>But forget money entirely when it comes to books.&nbsp;Reading is not a luxury. It’s not something you splurge on. It’s a necessity.</p><p>As Erasmus, the 16th century scholar once put it, “When I get a little money I buy books; and if any is left I buy food and clothes.”</p><p>On top of that, books are an investment. I hear from people all the time who tell me they plan to buy this book or that book. Plan? Just buy it. I promised myself a long time ago that if I saw a book that interested me I’d never let time or money or anything else prevent me from having it. Not money, not time, not my own laziness. Don’t wait around for some book you want to read to come out in paperback–trying to save $2 or $3 is the wrong mindset. If it’s a book you’ll read, then read it now, not in a year.</p><p>(One related note: I do a lot of work in libraries but they are not where I get my books. To me reading is not like watching a mindless movie you forget when you finished. You should be keeping the books&nbsp;<a href=\"http://thoughtcatalog.com/2013/read-to-lead-how-to-digest-books-above-your-level/\" rel=\"noopener noreferrer\" target=\"_blank\">you read for reference and for re-reading</a>. If you are OK giving the books back after two weeks you might want to examine what you are reading).</p>",
      "like": 0,
      "status": "verified",
      "createDate": "2022/04/12 14:58:45",
      "_id": {
        "$oid": "6255464dd09bc9da61825796"
      }
    },
    {
      "title": "Tools I wish I had known about when I started coding ",
      "image": "http://127.0.0.1:8000/image/16497560699884.jpeg",
      "path": "src\\public\\image\\16497560699884.jpeg",
      "category": "coding",
      "discription": "<h1>Chrome Extensions</h1><p><strong>Now that I am a self-proclaimed web developer, I practically live in my Chrome console. Below are some tools that allow me to spend less time there:</strong></p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<a href=\"https://chrome.google.com/webstore/detail/whatfont/jabopobgcpjmedljpbcaablpmlmfcogm?hl=en\" rel=\"noopener noreferrer\" target=\"_blank\"><strong>WhatFont</strong></a><strong>&nbsp;— The name says it all. This is an easy way of finding out the fonts that your favorite website is using, so that you can borrow them for your own projects.</strong></p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<a href=\"https://chrome.google.com/webstore/detail/pesticide-for-chrome/bblbgcheenepgnnajgfpiicnbbdmmooh?hl=en\" rel=\"noopener noreferrer\" target=\"_blank\"><strong>Pesticide</strong></a><strong>&nbsp;— Useful for seeing the outlines of your&nbsp;&lt;div&gt;s and modifying CSS. This was a lifesaver when I was trying to learn my way around the box-model.</strong></p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<a href=\"https://chrome.google.com/webstore/detail/colorzilla/bhlhnicpbhignbdhedgjhgdocnmhomnp?hl=en\" rel=\"noopener noreferrer\" target=\"_blank\"><strong>Colorzilla</strong></a><strong>&nbsp;— Useful for copying exact colors off of a website. This copies a color straight to your clipboard so you don’t spend forever trying to get the right RGBA combination.</strong></p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<a href=\"https://chrome.google.com/webstore/detail/css-peeper/mbnbehikldjhnfehhnaidhjhoofhpehk?hl=en\" rel=\"noopener noreferrer\" target=\"_blank\"><strong>CSS Peeper</strong></a><strong>&nbsp;— Useful for looking at colors and assets used on a website. A good exercise, especially when starting out, is cloning out websites that you think look cool. This gives you a peek under the hood at their color scheme and allows you to see what other assets exist on their page.</strong></p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<a href=\"https://chrome.google.com/webstore/detail/wappalyzer/gppongmhjkpfnbhagpmjfkannfbllamg?hl=en\" rel=\"noopener noreferrer\" target=\"_blank\"><strong>Wappalyzer</strong></a><strong>&nbsp;— Useful for seeing the technologies being used on a website. Ever wonder what kind of framework a website is using or what service it is hosted on? Look no further.</strong></p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<a href=\"https://chrome.google.com/webstore/detail/react-developer-tools/fmkadmapgofadopljbjfkapdkoienihi?hl=en\" rel=\"noopener noreferrer\" target=\"_blank\"><strong>React Dev Tools</strong></a><strong>&nbsp;— Useful for debugging your React applications. It bears mentioning that this is only useful if you are programming a React application.</strong></p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<a href=\"https://chrome.google.com/webstore/detail/redux-devtools/lmhkpmbekcpmknklioeibfkpmmfibljd?hl=en\" rel=\"noopener noreferrer\" target=\"_blank\"><strong>Redux Dev Tools</strong></a><strong>&nbsp;— Useful for debugging applications using Redux. It bears mentioning that this is only useful if you are implementing Redux in your application.</strong></p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<a href=\"https://chrome.google.com/webstore/detail/json-formatter/bcjindcccaagfpapjjmafapmmgkkhgoa?hl=en\" rel=\"noopener noreferrer\" target=\"_blank\"><strong>JSON Formatter</strong></a><strong>&nbsp;— Useful for making JSON look cleaner in the browser. Have you ever stared an ugly JSON blob in the face, trying to figure out how deeply nested the information you want is? Well this makes it so that it only takes 2 hours instead of 3.</strong></p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<a href=\"https://chrome.google.com/webstore/detail/vimeo-repeat-speed/noonakfaafcdaagngpjehilgegefdima?hl=en\" rel=\"noopener noreferrer\" target=\"_blank\"><strong>Vimeo Repeat and Speed</strong></a><strong>&nbsp;— Useful for speeding up Vimeo videos. If you watch video tutorials like most web developers, you know how handy it is to consume them at 1.25 times the regular playback speed. There are also versions for YouTube.</strong></p><p><br></p><h1>VS Code Extensions</h1><p><strong>Visual Studio Code is my editor of choice.</strong></p><p><strong>People love their text editors, and I am no exception. However, I’m willing to bet most of these extensions work for whatever editor you are using as well. Check out my favorite extensions:</strong></p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<a href=\"https://marketplace.visualstudio.com/items?itemName=formulahendry.auto-rename-tag\" rel=\"noopener noreferrer\" target=\"_blank\"><strong>Auto Rename Tag&nbsp;</strong></a><strong>— Auto rename paired HTML tags. You created a&nbsp;&lt;p&gt;&nbsp;tag. Now you want to change it, as well as its enclosing&nbsp;&lt;/p&gt;&nbsp;tag to something else. Simply change one and the other will follow. Theoretically improves your productivity by a factor of 2.</strong></p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<a href=\"https://marketplace.visualstudio.com/items?itemName=ecmel.vscode-html-css\" rel=\"noopener noreferrer\" target=\"_blank\"><strong>HTML CSS Support</strong></a><strong>&nbsp;— CSS support for HTML documents. This is useful for getting some neat syntax highlighting and code suggestions so that CSS only makes you want to quit coding a couple of times a day.</strong></p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<a href=\"https://marketplace.visualstudio.com/items?itemName=abusaidm.html-snippets\" rel=\"noopener noreferrer\" target=\"_blank\"><strong>HTML Snippets</strong></a><strong>&nbsp;— Useful code snippets. Another nice time saver. Pair this with&nbsp;</strong><a href=\"https://emmet.io/\" rel=\"noopener noreferrer\" target=\"_blank\"><strong>Emmet</strong></a><strong>&nbsp;and you barely ever have to type real HTML again.</strong></p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<a href=\"https://marketplace.visualstudio.com/items?itemName=dzannotti.vscode-babel-coloring\" rel=\"noopener noreferrer\" target=\"_blank\"><strong>Babel ES6/ES7</strong></a><strong>&nbsp;— Adds JavaScript Babel syntax coloring. If you are using Babel, this will make it much easier to differentiate what is going on in your code. This is neat if you like to play with modern features of JavaScript.</strong></p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<a href=\"https://marketplace.visualstudio.com/items?itemName=CoenraadS.bracket-pair-colorizer\" rel=\"noopener noreferrer\" target=\"_blank\"><strong>Bracket Pair Colorizer&nbsp;</strong></a><strong>— Adds colors to brackets for easier block visualization. This is handy for those all-too-common bugs where you didn’t close your brackets or parentheses accurately.</strong></p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<a href=\"https://marketplace.visualstudio.com/items?itemName=dbaeumer.vscode-eslint\" rel=\"noopener noreferrer\" target=\"_blank\"><strong>ESLint&nbsp;</strong></a><strong>— Integrates ESLint into Visual Studio Code. This is handy for getting hints about bugs as you are writing your code and, depending on your configuration, it can help enforce good coding style.</strong></p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<a href=\"https://marketplace.visualstudio.com/items?itemName=spywhere.guides\" rel=\"noopener noreferrer\" target=\"_blank\"><strong>Guides</strong></a><strong>&nbsp;— Adds extra guide lines to code. This is another visual cue to make sure that you are closing your brackets correctly. If you can’t tell, I’m a very visual person.</strong></p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<a href=\"https://marketplace.visualstudio.com/items?itemName=whtouche.vscode-js-console-utils\" rel=\"noopener noreferrer\" target=\"_blank\"><strong>JavaScript Console Utils&nbsp;</strong></a><strong>— Makes for easier console logging. If you are like most developers, you will find yourself logging to the console in your debugging flow (I know that we are supposed to use the debugger). This utility makes it easy to create useful&nbsp;console.log()&nbsp;statements.</strong></p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<a href=\"https://marketplace.visualstudio.com/items?itemName=streetsidesoftware.code-spell-checker\" rel=\"noopener noreferrer\" target=\"_blank\"><strong>Code Spell Checker</strong></a><strong>&nbsp;— Spelling checker that accounts for camelCase. Another common source of bugs is fat-thumbing a variable or function name. This spell checker will look for uncommon words and is good about accounting for the way we write things in JavaScript.</strong></p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<a href=\"https://marketplace.visualstudio.com/items?itemName=eamodio.gitlens\" rel=\"noopener noreferrer\" target=\"_blank\"><strong>Git Lens</strong></a><strong>&nbsp;— Makes it easier to see when, and by whom, changes were made. This is nice for blaming the appropriate person when code gets broken, since it is absolutely never your fault.</strong></p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<a href=\"https://marketplace.visualstudio.com/items?itemName=christian-kohler.path-intellisense\" rel=\"noopener noreferrer\" target=\"_blank\"><strong>Path Intellisense</strong></a><strong>&nbsp;— File path autocompletion. This is super handy for importing things from other files. It makes navigating your file tree a breeze.</strong></p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<a href=\"https://marketplace.visualstudio.com/items?itemName=esbenp.prettier-vscode\" rel=\"noopener noreferrer\" target=\"_blank\"><strong>Prettier&nbsp;</strong></a><strong>— Automatic code formatter. Forget about the days where you had to manually indent your code and make things human-legible. Prettier will do this for you much faster, and better, than you ever could on your own. I can’t recommend this one enough.</strong></p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<a href=\"https://marketplace.visualstudio.com/items?itemName=robertohuertasm.vscode-icons\" rel=\"noopener noreferrer\" target=\"_blank\"><strong>VSCode-Icons</strong></a><strong>&nbsp;— Adds icons to the file tree. If looking at your file structure hurts your eyes, this might help. There is a helpful icon for just about any kind of file you are making which will make it easier to distinguish what you are looking at.</strong></p><p><br></p><h1><strong>In Conclusion</strong></h1><p><strong>You likely have your own set of tools that are indispensable to your development cycle. Hopefully some of the tools I mentioned above can make your workflow more efficient.</strong></p><p><strong>Do not fall into the trap, however, of installing every tool you run across before learning to use the ones you already have, as this can be a huge time-sink.</strong></p><p><strong>I encourage you to leave your favorite tools in the comments below here, so that we can all learn together.</strong></p><p><strong>If you liked this article please give it some claps and check out other articles I’ve written&nbsp;</strong><a href=\"https://codeburst.io/how-i-cut-my-react-javascript-bundle-size-in-half-with-three-lines-of-code-fe7798ecbd3f\" rel=\"noopener noreferrer\" target=\"_blank\"><strong>here</strong></a><strong>,&nbsp;</strong><a href=\"https://medium.com/@mariohoyos/a-personal-case-for-gratitude-bff8345b3514\" rel=\"noopener noreferrer\" target=\"_blank\"><strong>here</strong></a><strong>,&nbsp;</strong><a href=\"https://codeburst.io/my-3-favorite-things-about-the-coding-bootcamp-experience-cd4e1a3fd3dc\" rel=\"noopener noreferrer\" target=\"_blank\"><strong>here</strong></a><strong>, and&nbsp;</strong><a href=\"https://medium.com/@mariohoyos/life-is-too-short-to-be-miserable-and-why-i-left-a-six-figure-job-in-the-search-for-something-327ab84416a9\" rel=\"noopener noreferrer\" target=\"_blank\"><strong>here</strong></a><strong>. Also, give me a follow on&nbsp;</strong><a href=\"https://twitter.com/marioahoyos\" rel=\"noopener noreferrer\" target=\"_blank\"><strong>Twitter</strong></a><strong>.</strong></p><h1>&nbsp;</h1><p><br></p>",
      "like": 0,
      "status": "verified",
      "createDate": "2022/04/12 15:04:30",
      "_id": {
        "$oid": "625547a6d09bc9da618257f9"
      }
    },
    {
      "title": "Graphic Design: Winter Olympics Illustration. Step-by-Step Tutorial",
      "image": "http://127.0.0.1:8000/image/16497561343354.png",
      "path": "src\\public\\image\\16497561343354.png",
      "category": "sport",
      "discription": "<p>A creative process which designers set for digital illustration may vary in approaches, tools, and stages. Yet, it’s always interesting to see the real workflow through which illustrators go all the path from the idea to the final artwork. Today we want to unveil such a step-by-step progress for a digital illustration by Tubik designer Yaroslava Yatsuba. Recently she shared the set of helpful&nbsp;<a href=\"https://tubikstudio.com/how-to-create-original-flat-illustrations-designers-tips/\" rel=\"noopener noreferrer\" target=\"_blank\">tips on flat illustration</a>&nbsp;design — how to catch your original style not losing harmony and balance. This time let’s move one to the work-in-progress case study.</p><p>Having explored the work styles and approaches, Yaroslava says that with long-term practice, both traditional and digital artists work out their own routine and the number of creative stages. In this post, she shares her process which mostly has 5 steps. Here it’s presented by the example of her fresh artwork reflecting the theme of Winter Olympic Games.</p><h1>Stage 1: sketching by hand</h1><p>The first stage is devoted to the search of composition, dimensions, characters and their interactions. It is done by hand sketching. If this sketch isn’t going to be shown to clients, don’t try to go deep into all the details — strive for the level of fidelity clear for you personally and saving the ideas.</p><p><br></p><h1>Stage 2: turning a traditional sketch into digital</h1><p>The second stage transforms the idea from traditional to digital drawing. Yaroslava uses the scanned or photographed sketch as a base in the Adobe Illustrator. Then she starts to outline the sketch using Pen Tool if lines are strict and Curvative Tool in case of smooth lines. At this stage, she draws the main dimensions without details as well as moves bodies and structure in search of the nice composition. This is the phase when the frame of the illustration is created.</p><p><br></p><h1>Stage 3: color choice</h1><p>The third stage is all about color. The designer has to make the decision about color palette and combinations. In this particular illustration, the choice was not so hard: she decided to apply the colors of symbolic Olympic rings. Each of them was used as the basis for a particular ring with the character inscribed into it.</p><p><br></p><h1>Stage 4: dimensions and details</h1><p>The next stage is devoted to working out details and adding volume. The dimensions and shapes are getting clearer and sharper.</p><p><br></p><h1>Stage 5. Textures and dynamics</h1><p>At the final stage, the designer adds the textures. They breathe in life into the visual images. In this illustration, textures allowed for setting the effect of speed, dynamics as well as visual prompts of the winter season.</p>",
      "like": 0,
      "status": "verified",
      "createDate": "2022/04/12 15:05:34",
      "_id": {
        "$oid": "625547e6d09bc9da6182580b"
      }
    },
    {
      "title": "What Rugby Can Teach Us About Building Teams and Reinforcing Company Culture",
      "image": "http://127.0.0.1:8000/image/16497561722203.png",
      "path": "src\\public\\image\\16497561722203.png",
      "category": "sport",
      "discription": "<p>The Rugby World Cup is coming up later this month and with it comes one of the most prized trophies on the planet. Rugby is not a game for the faint of heart. It’s an intense sport, played by fierce men and women. It’s the ultimate team game, a perfect display of mental and physical toughness. Surprisingly, the culture surrounding the rugby world can teach us a lot about organizational culture.</p><p>In rugby, nothing successful happens on the field unless every person on the team excels at their individual position. It’s different from American football; not tougher or better, just different. Starting play from the scrum — the rough equivalent of the line of scrimmage in American football — is an ideal showcase of teamwork. In the scrum, players don’t make individual blocks. You are locked at the arm and hip when you engage and smash into the other squad. You can instantly feel the power (or lack thereof) of the other team. You immediately feel the strength of your own team on either side of you, and you know that you’re supported and working with something bigger than yourself. The essence of competition plays out in front of your eyes, you can feel it in your legs and your mind, your shoulders and your heart.</p><p>One of my favorite squads in the Rugby World Cup this year is Ireland. They aren’t in the discussion as the best club in the tournament, and it’ll be a long shot for them to hoist the Webb Ellis Cup. But the Irish team is tough. They have a reputation for being resilient, intense and they never, ever quit.</p><p>The Irish team has a mantra, a creed and a bond. It’s called “shoulder to shoulder.” They go into every match bonded together, as one, to take on the challenge and give their all to win. Shoulder to shoulder.</p><p>That’s the mentality that companies big and small should incorporate into their culture. The goal of any corporate culture should be for employees to genuinely care about each other and work together towards a common goal. Forget about a hierarchy of corporate levels, get rid of any divide between marketing, sales, IT or the c-suite. The second you have one person asking for the spotlight you’ll have an instant imbalance in the scrum. Every member of your company should be lining up as one, shoulder to shoulder.</p><p>Yes, it’s incredibly important to have proper leadership and a process for decision-making, especially at large, enterprise companies. But creating and upholding a company’s culture shouldn’t be viewed as a top-down or bottom-up approach. Everyone is responsible for building and reinforcing culture, and if you build the right team, individuals will take it upon themselves to do just that. The more an organization grows, the more leadership must depend on others in the organization to develop and disperse culture. It involves bringing on the right people who will continue to cherish and build that culture.</p><p>It can be tough to find the right balance of transparency and leadership, teamwork and toughness, to build a culture that makes your employees genuinely care about one another. But the companies that are able to do this, even amidst rapid growth, are the ones who go come out of the scrum on top. Companies that reinforce a shoulder-to-shoulder culture are the ones that see success in the long run.</p><h2><strong>About the Author</strong></h2><p><em>Ed Calnan is the founder and President of&nbsp;</em><a href=\"http://www.seismic.com/\" rel=\"noopener noreferrer\" target=\"_blank\"><em>Seismic</em></a><em>, a leading sales enablement platform. Calnan has more than 20 years of sales leadership experience from ADP, Thomson Financial, S&amp;P Capital IQ, Document Sciences and EMC. He holds a B.A. in Political Science from St. Michael’s College.</em></p><p><em>Your time is precious. It’s time to make every second count. Learn how to take your productivity to the max&nbsp;</em><a href=\"https://www.salesforce.com/form/pdf/5-productivity-tips.jsp?d=70130000000iGVY&amp;nc=70130000000iGVJ\" rel=\"noopener noreferrer\" target=\"_blank\"><em>with our latest e-book today.</em></a></p>",
      "like": 0,
      "status": "unverified",
      "createDate": "2022/04/12 15:06:12",
      "_id": {
        "$oid": "6255480cd09bc9da6182582a"
      }
    }
  ],
  "__v": 0
},{
  "_id": {
    "$oid": "6255469a548e0c1178da8aea"
  },
  "source_id": {
    "$oid": "62553b277287ef1ef2344a60"
  },
  "blog": [],
  "__v": 0
},{
  "_id": {
    "$oid": "625548b4d09bc9da61825864"
  },
  "source_id": {
    "$oid": "6255410bd09bc9da61825746"
  },
  "blog": [
    {
      "title": "The 10 Best Coding Challenge Websites for 2018",
      "image": "http://127.0.0.1:8000/image/16497563401965.jpeg",
      "path": "src\\public\\image\\16497563401965.jpeg",
      "category": "coding",
      "discription": "<p>At the end of 2016 I published the article:&nbsp;<a href=\"https://medium.freecodecamp.org/the-10-most-popular-coding-challenge-websites-of-2016-fb8a5672d22f\" rel=\"noopener noreferrer\" target=\"_blank\">The 10 most popular coding challenge websites for 2017</a>. The list was based on a few resources such as popular blog posts, Quora posts, articles, Google searches, and popular posts on forums like&nbsp;<a href=\"https://www.reddit.com/r/learnprogramming/\" rel=\"noopener noreferrer\" target=\"_blank\">r/learnprogramming</a>&nbsp;and&nbsp;<a href=\"https://news.ycombinator.com/item?id=13566247\" rel=\"noopener noreferrer\" target=\"_blank\">Hacker News</a>.</p><p>This updated 2018 list features 10 websites that offer the&nbsp;<strong>best coding challenges&nbsp;</strong>and resources to help new and intermediate developers&nbsp;<strong>improve their skills</strong>,&nbsp;<strong>prepare for interviews</strong>, and&nbsp;<strong>progress in their careers</strong>.&nbsp;<em>The ordering of the list is based on level of difficulty (beginner to advanced).</em></p><h1><a href=\"https://www.coderbyte.com/\" rel=\"noopener noreferrer\" target=\"_blank\">1. Coderbyte</a></h1><p>                    </p><p><br></p><p><strong><em>Beginner — Intermediate</em></strong></p><p>Coderbyte provides 200+ coding challenges you can solve in an online editor using 10 different programming languages. It also provides official solutions for some of the challenges along with 800,000+ user solutions. Coderbyte is recommended by the&nbsp;<a href=\"https://www.coderbyte.com/organizations\" rel=\"noopener noreferrer\" target=\"_blank\">top coding bootcamps</a>&nbsp;because of its collection of interview prep challenges.</p><p>Aside from coding challenges, they provide courses in&nbsp;<a href=\"https://www.coderbyte.com/course/learn-data-structures-and-algorithms/\" rel=\"noopener noreferrer\" target=\"_blank\">Algorithms &amp; Data Structures</a>,&nbsp;<a href=\"https://www.coderbyte.com/course/fullstack-web-development/\" rel=\"noopener noreferrer\" target=\"_blank\">Web Development</a>, and prep courses for&nbsp;<a href=\"https://www.coderbyte.com/course/prepare-hack-reactor\" rel=\"noopener noreferrer\" target=\"_blank\">coding bootcamps</a>.</p><h1><a href=\"https://www.codewars.com/\" rel=\"noopener noreferrer\" target=\"_blank\">2. Codewars</a></h1><p>  </p><p><br></p><p><strong><em>Beginner — Intermediate</em></strong></p><p>Codewars provides a large collection of coding challenges submitted and edited by their own community.&nbsp;You can solve the challenges directly&nbsp;<a href=\"https://www.codewars.com/kata/trailing-zeros-in-factorials-in-any-given-integer-base/train/javascript\" rel=\"noopener noreferrer\" target=\"_blank\">online</a>&nbsp;in their editor using one of 20+ programming languages. You can view a discussion for each challenges as well as user solutions. You can earn points and climb the rankings by solving their challenges.</p><h1><a href=\"https://codefights.com/\" rel=\"noopener noreferrer\" target=\"_blank\">3. CodeFights</a></h1><p>  </p><p><br></p><p><strong><em>Beginner — Intermediate</em></strong></p><p>CodeFights provides a collection of coding challenges for you to solve in their online editor and there is a&nbsp;<a href=\"https://codefights.com/forum\" rel=\"noopener noreferrer\" target=\"_blank\">forum</a>&nbsp;for users to discuss the challenges. They also have a feature called&nbsp;<a href=\"https://codefights.com/company-bots\" rel=\"noopener noreferrer\" target=\"_blank\">Company Bots</a>&nbsp;where you write code to compete against a “bot” that was programed by engineers at companies like Uber, Dropbox, and Quora.</p><h1><a href=\"https://www.codingame.com/start\" rel=\"noopener noreferrer\" target=\"_blank\">4. CodinGame</a></h1><p>  </p><p><br></p><p><strong><em>Beginner — Intermediate</em></strong></p><p>This website is different than the ones listed above because instead of simply solving coding challenges by producing a set of outputs, on CodinGame you write code to actually play a game online. It’s a great website and some of the games are very fun to watch once you’ve written your code (see&nbsp;<a href=\"https://www.codingame.com/ide/980141293426648e9f31adb0881e1e01ae52d38\" rel=\"noopener noreferrer\" target=\"_blank\">example</a>). The game graphics are nice and the editor/game UI is very smooth. Overall it’s a great website for beginners to learn coding.</p><h1><a href=\"https://www.topcoder.com/challenges/\" rel=\"noopener noreferrer\" target=\"_blank\">5. TopCoder</a></h1><p>  </p><p><br></p><p><strong><em>Intermediate — Advanced</em></strong></p><p>TopCoder is one of the original platforms for competitive programming online. It provides a list of&nbsp;<a href=\"https://www.topcoder.com/community/how-it-works/\" rel=\"noopener noreferrer\" target=\"_blank\">algorithmic challenges</a>&nbsp;from the past that you can complete on your own directly online using their code editor. Their popular Single Round Matches are offered a few times per month at a specific time where you compete against others to solve challenges. Here are some&nbsp;<a href=\"https://www.topcoder.com/community/data-science/data-science-tutorials/\" rel=\"noopener noreferrer\" target=\"_blank\">topics</a>&nbsp;that their challenges may cover.</p><p>Aside from solving challenges for fun online, they offer sponsored competitions where you can&nbsp;<a href=\"https://www.topcoder.com/challenges/\" rel=\"noopener noreferrer\" target=\"_blank\">win prizes</a>&nbsp;for writing the best solution.</p><h1><a href=\"https://www.hackerrank.com/\" rel=\"noopener noreferrer\" target=\"_blank\">6. HackerRank</a></h1><p>  </p><p><br></p><p><strong><em>Intermediate — Advanced</em></strong></p><p>HackerRank focuses on computer science topics so it provides challenges for several domains such as Algorithms, Mathematics, SQL, Functional Programming, AI, and more. You can solve all the challenge directly online (see&nbsp;<a href=\"https://www.hackerrank.com/challenges/simple-array-sum\" rel=\"noopener noreferrer\" target=\"_blank\">example</a>). They provide a discussion and leaderboard for every challenge, and most challenges come with an editorial that explains more about the challenge and how to approach it to come up with a solution.</p><h1><a href=\"https://leetcode.com/\" rel=\"noopener noreferrer\" target=\"_blank\">7. LeetCode</a></h1><p>  </p><p><br></p><p><strong><em>Intermediate — Advanced</em></strong></p><p>LeetCode has a collection of some of the best algorithm challenges online today. The topics they cover require knowledge of data structures such as binary trees, heaps, linked lists, etc., which is why their challenges are a bit more advanced than some other websites — but the challenges are great if used when preparing for a software engineering interview.</p><p>They also have a&nbsp;<a href=\"https://leetcode.com/mockinterview/\" rel=\"noopener noreferrer\" target=\"_blank\">Mock Interview</a>&nbsp;section that is specifically for job interview preparation, they host their own coding&nbsp;<a href=\"https://leetcode.com/contest/\" rel=\"noopener noreferrer\" target=\"_blank\">contests</a>, and they have a section for&nbsp;<a href=\"https://leetcode.com/articles/pour-water/\" rel=\"noopener noreferrer\" target=\"_blank\">articles</a>&nbsp;to help you better understand certain problems.</p><h1><a href=\"https://www.codechef.com/\" rel=\"noopener noreferrer\" target=\"_blank\">8. CodeChef</a></h1><p>  </p><p><br></p><p><strong><em>Intermediate — Advanced</em></strong></p><p>CodeChef is an Indian-based competitive programming&nbsp;<a href=\"https://en.wikipedia.org/wiki/CodeChef\" rel=\"noopener noreferrer\" target=\"_blank\">website</a>&nbsp;that provides hundreds of challenges. You are able to write code in their online&nbsp;<a href=\"https://www.codechef.com/ide\" rel=\"noopener noreferrer\" target=\"_blank\">editor</a>&nbsp;and view a collections of challenges that are separated into different categories depending on your skill level (see&nbsp;<a href=\"https://www.codechef.com/problems/TREEFUN\" rel=\"noopener noreferrer\" target=\"_blank\">example</a>). They have a large community of coders that contribute to the forums, write&nbsp;<a href=\"https://www.codechef.com/wiki/tutorial-paying\" rel=\"noopener noreferrer\" target=\"_blank\">tutorials</a>, and take part in CodeChef’s coding&nbsp;<a href=\"https://www.codechef.com/contests/\" rel=\"noopener noreferrer\" target=\"_blank\">competitions</a>.</p><h1><a href=\"https://www.geeksforgeeks.org/\" rel=\"noopener noreferrer\" target=\"_blank\">9. GeeksforGeeks</a></h1><p>  </p><p><br></p><p><strong><em>Intermediate — Advanced</em></strong></p><p>GeeksforGeeks has the&nbsp;<a href=\"https://www.geeksforgeeks.org/fundamentals-of-algorithms/\" rel=\"noopener noreferrer\" target=\"_blank\">best collection</a>&nbsp;of articles, explanations, and code solutions for algorithms and data structure topics. You can see an&nbsp;<a href=\"https://www.geeksforgeeks.org/shortest-common-supersequence/\" rel=\"noopener noreferrer\" target=\"_blank\">example here</a>&nbsp;of how they break down a complex question into simpler parts, explain the solution and then provide a code solution. They also have an online&nbsp;<a href=\"https://practice.geeksforgeeks.org/problems/rotate-a-linked-list/1\" rel=\"noopener noreferrer\" target=\"_blank\">editor</a>&nbsp;where you can practice solving challenges yourself before seeing the solution.</p><p>If you are preparing for a software engineering interview, you should definitely use this website to prepare and brush up on the harder algorithm questions.</p><h1><a href=\"http://codeforces.com/\" rel=\"noopener noreferrer\" target=\"_blank\">10. Codeforces</a></h1><p>  </p><p><br></p><p><strong><em>Advanced</em></strong></p><p>Codeforces is a Russian-based competitive programming&nbsp;<a href=\"https://en.wikipedia.org/wiki/Codeforces\" rel=\"noopener noreferrer\" target=\"_blank\">website</a>&nbsp;that regularly hosts competitions where some of the&nbsp;<a href=\"http://codeforces.com/profile/tourist\" rel=\"noopener noreferrer\" target=\"_blank\">best</a>&nbsp;competitive programmers in the world compete online. If you’re a beginner coder, their challenges will most likely be too advanced for you — here are&nbsp;<a href=\"http://codeforces.com/problemset/problem/908/C\" rel=\"noopener noreferrer\" target=\"_blank\">some</a>&nbsp;<a href=\"http://codeforces.com/problemset/problem/908/C\" rel=\"noopener noreferrer\" target=\"_blank\">example</a>s of recent challenges. Their challenges usually require advanced math and algorithms knowledge.</p>",
      "like": 0,
      "status": "unverified",
      "createDate": "2022/04/12 15:09:00",
      "_id": {
        "$oid": "625548b4d09bc9da61825865"
      }
    }
  ],
  "__v": 0
},{
  "_id": {
    "$oid": "62554a5a433cd9fb47ef22f6"
  },
  "source_id": {
    "$oid": "625541e9d09bc9da61825752"
  },
  "blog": [
    {
      "title": "The Facts are True, the News is Fake",
      "image": "http://127.0.0.1:8000/image/16497567623514.jpeg",
      "path": "src\\public\\image\\16497567623514.jpeg",
      "category": "news",
      "discription": "<h1>How to Disagree with Yourself</h1><p>In the summer of 2009, I partook of a an hour long discussion with David Cameron, who was in the running for, and later became, the U.K. Prime Minister. The discussion was about how to make society robust, even immune to Black Swans, what structure was needed for both decentralization and accountability, and how the system should be built, that sort of thing. It was an interesting fifty-nine minutes around the topics of the&nbsp;<em>Incerto</em>&nbsp;and I felt great communicating all the points in bulk for the first time. The room in the elegant Royal Society for the Arts was full of journalists. I subsequently went to a Chinese restaurant in (London’s) Soho to celebrate with a few people when I received a phone call by a horrified friend. All London newspapers were calling me a “climate denier”, portraying me as someone part of a large anti-environment conspiracy.</p><p><em>The entire fifty-nine minutes were summarized by the press and reported from a tangential comment that lasted twenty seconds taken in reverse.</em>&nbsp;Someone who didn’t attend the conference would have been under the impression that that was the whole conversation.</p><p>It turned out that I presented my version of the&nbsp;<a href=\"http://www.fooledbyrandomness.com/PrecautionaryPrinciple.html\" rel=\"noopener noreferrer\" target=\"_blank\">precautionary principle</a>&nbsp;during the conversation, worth restating here. It asserted that one does not need complex models as a justification to avoid a certain action. If we don’t understand something and it has a systemic effect, just avoid it. Models are error prone, something I knew well with finance; most risks only appear in analyses after harm is done. The burden is on those who pollute –or introduce new substances in larger than usual quantities –to show their lack of risk. In fact the more uncertainty about the models, the more conservative one should be. Ironically the same newspapers had lauded&nbsp;<em>The Black Swan</em>&nbsp;in which this very point was fleshed out very clearly.</p><p>I managed to defend myself by making a lot of noise, and with explicit legal threats, forced every newspaper to publish my correction. Even then someone at&nbsp;<em>The Guardian</em>&nbsp;tried (unsuccessfully) to tone down my letter by showing that it was some type of&nbsp;<em>disagreement</em>&nbsp;with what&nbsp;<em>I</em>&nbsp;said, not a correction of their misrepresentation. In other words I was disagreeing with myself.</p><p>But if I eventually cleared my ideas, thanks to my bully pulpit, other can’t do the same. The London newspapers were actively misrepresenting something to their own public. Someone who read the paper was mistaking the journalist for an intermediary between himself or herself and the product, the piece of news.</p>",
      "like": 0,
      "status": "verified",
      "createDate": "2022/04/12 15:16:02",
      "_id": {
        "$oid": "62554a5a433cd9fb47ef22f7"
      }
    },
    {
      "title": "EWS students not able to take online classes due to lack of facilities",
      "image": "http://127.0.0.1:8000/image/16497568087052.jpeg",
      "path": "src\\public\\image\\16497568087052.jpeg",
      "category": "other",
      "discription": "<p>The Coronavirus Pandemic is not only taking a toll on lives, but the future of students is also at stake. Students in Delhi who are studying in private school under the Economically Weaker Section Scheme are not able to attend online classes as they do not have a laptop or smartphone.</p><p>&nbsp;</p><p><br></p><p>Watch video here-&nbsp;<a href=\"https://streakshot.com/latest-stories/ews-students-not-able-to-take-online-classes-due-to-lack-of-facilities\" rel=\"noopener noreferrer\" target=\"_blank\"><strong>Coronavirus affecting development of EWS students</strong></a></p><p>&nbsp;</p><p>The private schools have started with online classes to cover the curriculum amid the nationwide lockdown. But, the EWS students are facing significant challenges. One incident came into light, where a six year old student name Shanti (name changed) is not able to study and is repeatedly asking her mother, “Why am I not able to study?”</p><p>&nbsp;</p><p>The helpless mother said that she is tired answering her difficult question because the truth is we have no means to get a smartphone or laptop. Shanti’s mother told The Quint on call, “What do I even tell her? I have to explain to her that we don’t have any device (smartphone or laptop).”</p><p>&nbsp;</p><p>She said that at times she sends her daughter to her neighbour’s house to study on their Smartphone, but that’s not possible everyday. She said, “Online classes have started and my daughter goes to the neighbour’s (house) to access these classes. We can go to our neighbour’s for one day, or two days, but after that, they can also say no. And it doesn’t feel good to send my daughter to their house again and again.”</p><p>&nbsp;</p><p>To add to their misery, her husband is unemployed as the manufacturing unit where he was working is completely shut down. They are uncertain whether they will be paid during the lockdown or not. Same is the plea of vegetable vendor Manish, whose daughter is studying on his Smartphone, but is not sure whether he will be able to get the next recharge done or not as he is using earnings of the March and has no idea when he will be able to open his vegetable stall in future.</p><p>&nbsp;</p><p>He said, “Because of the lockdown, I am unable to recharge my phone data, as shops are shut. On the school’s website, we are only able to watch a few videos and have to skip other videos. Our daughter’s education is suffering. I haven’t been able to open the stall. Obviously, money matters a lot.”</p><p>&nbsp;</p><p>Mother of another child, Ritu told that they don’t have enough money to feed their family, so buying a laptop or Smartphone is out of the question.</p>",
      "like": 0,
      "status": "verified",
      "createDate": "2022/04/12 15:16:48",
      "_id": {
        "$oid": "62554a88433cd9fb47ef2304"
      }
    },
    {
      "title": "“Alexa, play some music” isn’t the only time Amazon is listening to you.",
      "image": "http://127.0.0.1:8000/image/16497569455383.jpeg",
      "path": "src\\public\\image\\16497569455383.jpeg",
      "category": "other",
      "discription": "<p>Amazon’s voice recognition software only listens when you say the word “Alexa,” right?</p><p>That’s what most Echo and Dot buyers think because that’s what the advertising leads you to believe. As if by magic, your Alexa-enabled device “wakes up” when you say its name. But think about that for a moment. After you say the magic word, your Alexa-enabled device must listen for your request, interpret it, and respond. Just how much does Amazon really listen to inside your home? How much you&nbsp;<em>really know</em>&nbsp;about how voice technology works when you unboxed your Alexa-enabled device?</p><p>&nbsp;</p><p>(Fair warning: this is about to get awkward.)</p><p>&nbsp;</p><p>You may have assumed your Echo or Dot listened and responded using the small computer housed inside the device itself. But that doesn’t make sense. The on-board computer simply isn’t powerful enough. And besides, Amazon continues to update the device. It must do this from a centralized server location. That’s the only place where there is enough computing power not only to interpret your request, but also to update Alexa with new “skills” from third-party vendors. That’s how your device now knows how to order a pizza. Amazon needed to partner with Domino’s Pizza (in the United States) to develop that interface.</p><p>&nbsp;</p><p>Now that you know that your voice recordings are being sent via the internet to a centralized location, you may have assumed Amazon will need to&nbsp;<em>store</em>&nbsp;that data for some period of time — for example, to use its Natural Language Processing algorithms to interpret your request for a weather report (or to buy a pizza), gather that information, and then send it back to your device for it to speak the response. The transaction happens so quickly that you assume Amazon would have no reason to keep the recording of your voice any longer than a few seconds. Besides, is that even feasible? Think of how much storage space Amazon would require for all of the audio files. Is there really a database somewhere storing all your “requests for weather reports?”</p><p>&nbsp;</p><p>Those are good questions.</p><p><img src=\"https://i.guim.co.uk/img/media/117fb0d94960b88fe2704b8232c0d280881058b6/788_650_3705_2223/master/3705.jpg?width=1200&amp;height=1200&amp;quality=85&amp;auto=format&amp;fit=crop&amp;s=42c7957a367cff2342e03e31eb7f9402\"></p><p>&nbsp;</p><p>Imagine for a moment that you were curious about what, precisely, your Amazon Echo or Dot device recorded in your home. Now that you know it’s listening, you’d like to know what it heard. To satisfy that curiosity and put your mind at ease, you ask Amazon to send you a copy of the data your device has collected since you bought it.</p><p>&nbsp;</p><p>After a few weeks, you receive your audio files from Amazon. Imagine your horror as you open the attachments and begin listening to the recordings: A discussion of what to have for dinner, two children arguing over a toy, a woman talking to her partner as she gets into the shower. You weren’t really sure if Amazon would keep recordings at all. And if they did keep recordings, you thought your Echo or Dot recorded only your explicit requests.</p><p>&nbsp;</p><p>But it gets worse. You don’t recognize any of the voices. With equal parts relief and horror, you realize you are listening to someone else’s Echo recordings!</p><p>&nbsp;</p><p><strong>As it turns out, all of your assumptions about voice technology were wrong.</strong></p><p>&nbsp;</p><p>This story isn’t a thought experiment. It is precisely what happened when a German citizen who requested his data files from Amazon under the European Union’s GDPR regulation. He expected to get a list of the products he has purchased, how he paid, and other commercial profile data Amazon compiled. Unlike my scenario, he wasn’t expecting audio recordings. He&nbsp;<em>didn’t own</em>&nbsp;an Alexa-enabled device. He shouldn’t have been getting&nbsp;<em>any</em>&nbsp;recordings, yet there they were.</p><p>&nbsp;</p><p>According to the story originally reported by the&nbsp;<a href=\"https://www.heise.de/downloads/18/2/5/6/5/3/9/6/ct.0119.016-018_engl.pdf\" rel=\"noopener noreferrer\" target=\"_blank\">German investigative magazine&nbsp;<em>c’t</em></a>, Amazon admitted the mistake, citing human error in sending him the wrong file.</p><p>&nbsp;</p><p>(The statement fails to mention if the company notified the person whose data was shared. Also, Amazon was only compelled to comply with the request for data because the requestor was a European Union citizen. If you’re an American, or from anywhere outside the EU, good luck.)</p>",
      "like": 0,
      "status": "verified",
      "createDate": "2022/04/12 15:19:05",
      "_id": {
        "$oid": "62554b11433cd9fb47ef2343"
      }
    }
  ],
  "__v": 0
},{
  "_id": {
    "$oid": "62554bb1433cd9fb47ef238a"
  },
  "source_id": {
    "$oid": "62554443d09bc9da6182576b"
  },
  "blog": [
    {
      "title": "It’s time to move away from Gmail",
      "image": "http://127.0.0.1:8000/image/16497571058134.jpeg",
      "path": "src\\public\\image\\16497571058134.jpeg",
      "category": "other",
      "discription": "<p>&nbsp;Imagine you hop on your computer one morning to suddenly find that you’ve been locked out of your google account. You’ve been banned. It’s not just your email account you don’t have access to — it’s everything linked to it. All your single sign-in google linked accounts on other websites, your google drive, your email 2 factor authentication (including medium itself, which sends you an email sign in link rather than deal with passwords), your Youtube account, purchases made on Google Play, videos and photos on Google photos. The list goes on.</p><h2>Your email these days isn’t just a point of contact. It’s inextricably linked to your online identity</h2><p>Don’t believe it can happen to you?&nbsp;<a href=\"https://www.reddit.com/r/GooglePixel/comments/7nrx07/google_permanently_banned_my_account_because/\" rel=\"noopener noreferrer\" target=\"_blank\">Here</a>&nbsp;is a story on reddit from a user who returned their google purchased phone device. They returned their google purchased phone device but due to a putative mix-up in the RMA process, part of their system failed to recognize that the device was returned. The subsequent credit card charge back flagged the account as potentially fraudulent causing the subsequent ban. Though we can’t fully verify the authenticity of the story, we can certainly take heed as at the very least a warning sign.</p><p>Your online identity shouldn’t have one point of failure. Doubly so if you are conducting your business through a free gmail account. So what is the alternative?</p><h2>Purchase your own domain name and set it up with an email host</h2><p>If you’re use to the Gmail interface and still want to use it, you can! You can set up a Google Workspace account and have google as your email host. If there’s ever a hiccup, you can quickly switch to a new host by changing your domain name MX records. There are a lot of good, affordable options. I’ve listed some of them below:</p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<a href=\"https://protonmail.com/signup\" rel=\"noopener noreferrer\" target=\"_blank\">ProtonMail</a>&nbsp;(8€ / mo)</p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<a href=\"https://tutanota.com/pricing\" rel=\"noopener noreferrer\" target=\"_blank\">TutaNota</a>&nbsp;(1€ / mo) — I use this one</p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<a href=\"https://postale.io/pricing\" rel=\"noopener noreferrer\" target=\"_blank\">Postale.io</a>&nbsp;($1 / mo)</p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<a href=\"https://workspace.google.com/pricing.html\" rel=\"noopener noreferrer\" target=\"_blank\">Google Workspace</a>&nbsp;($6 / mo)</p><p>Another benefit of setting up your own domain name for your email is having a catch all system in place.&nbsp;For every website I sign up to I have the name of the site @mydomain.com. You can have medium@yourdomain.com, airbnb@yourdomain.com, github@yourdomain.com etc. If you ever get spam, you’ll know who sold you out.</p><p>And if you still use your google account to sign in to other websites and services, consider weaning off them and creating a dedicated email login — so that you still have access to those services regardless of what happens with your google account. And if you haven’t already, consider using a password manager such as&nbsp;<a href=\"https://bitwarden.com/\" rel=\"noopener noreferrer\" target=\"_blank\">Bitwarden</a>&nbsp;of&nbsp;<a href=\"https://www.1password.com/\" rel=\"noopener noreferrer\" target=\"_blank\">1Password</a>.</p><p>Edit: I wrote a follow up piece on how to go about setting up your own domain name email for anyone interested in doing so.</p>",
      "like": 0,
      "status": "verified",
      "createDate": "2022/04/12 15:21:45",
      "_id": {
        "$oid": "62554bb1433cd9fb47ef238b"
      }
    },
    {
      "title": "99 Good News Stories You Probably Didn’t Hear About in 2018",
      "image": "http://127.0.0.1:8000/image/16497571361215.jpeg",
      "path": "src\\public\\image\\16497571361215.jpeg",
      "category": "news",
      "discription": "<p><br></p><p>For the last 12 months, the global media has been focused on a lot of bad news. But there were other things happening out there too: conservation successes, huge wins for global health, more peace and tolerance, less war and violence, rising living standards, some big clean energy milestones, and a quiet turning of the tide in the fight against plastic. Stories of human progress, that didn’t make it into the evening broadcasts, or onto your social media feeds.</p><p><br></p><p>1. The Kofan people of Sinangoe, in the Ecuadorian Amazon, won a landmark legal battle to protect the headwaters of the Aguarico River, nullifying 52 mining concessions and freeing up more than 32,000 hectares of primary rainforest.&nbsp;<a href=\"https://www.amazonfrontlines.org/chronicles/sinangoe-victory/\" rel=\"noopener noreferrer\" target=\"_blank\">Amazon Frontlines</a></p><p>2. Following China’s ban on ivory last year, 90% of Chinese support it, ivory demand has dropped by almost half, and poaching rates&nbsp;<a href=\"https://www.news.com.au/technology/environment/conservation/china-has-banned-ivory-but-has-the-african-elephant-poaching-crisis-actually-been-stemmed/news-story/b086f6a0e61acfcc15abeed18f899136\" rel=\"noopener noreferrer\" target=\"_blank\">are falling</a>&nbsp;in places like Kenya.&nbsp;<a href=\"https://www.wwf.org.uk/updates/what-impact-chinas-ivory-ban\" rel=\"noopener noreferrer\" target=\"_blank\">WWF</a></p><p>3. The population of wild tigers in Nepal was found to have nearly doubled in the last nine years, thanks to efforts by conservationists and increased funding for protected areas.&nbsp;<a href=\"https://www.independent.co.uk/environment/tigers-nepal-double-wwf-conservation-big-cats-wildlife-trade-a8551271.html\" rel=\"noopener noreferrer\" target=\"_blank\">Independent</a></p><p>4. Deforestation in Indonesia fell by 60%, as a result of a ban on clearing peatlands, new educational campaigns and better law enforcement.&nbsp;<a href=\"https://www.ecowatch.com/indonesia-deforestation-2595918463.html\" rel=\"noopener noreferrer\" target=\"_blank\">Ecowatch</a></p><p>5. The United Nations said that the ozone hole would be fully healed over the Arctic and the northern hemisphere by the 2030s, and in the rest of the world by 2060.&nbsp;<a href=\"https://earther.gizmodo.com/the-ozone-hole-could-heal-in-our-lifetimes-un-reports-1830260403?IR=T\" rel=\"noopener noreferrer\" target=\"_blank\">Gizmodo</a></p><p>6. $10 billion (the largest amount ever for ocean conservation) was committed in Bali this year for the protection of 14 million square kilometres of the world’s oceans.&nbsp;<a href=\"https://news.mongabay.com/2018/10/10bn-pledged-in-new-commitments-to-protect-the-worlds-oceans/\" rel=\"noopener noreferrer\" target=\"_blank\">MongaBay</a></p><p>7. In California, the world’s smallest fox was removed from the Endangered Species List, the fastest recovery of any mammal under the Endangered Species Act.&nbsp;<a href=\"https://www.conserveca.org/campaign/endangered-island-foxes-break-record-for-fast-recovery\" rel=\"noopener noreferrer\" target=\"_blank\">Conservaca</a></p><p>8. In 2018, after more than ten years of debate, 140 nations agreed to begin negotiations on a historic “<em>Paris Agreement for the Ocean,</em>” the first-ever international treaty to stop overfishing and protect life in the high seas.&nbsp;<a href=\"https://news.nationalgeographic.com/2017/12/un-high-seas-conservation-treaty-ocean-protection-spd/\" rel=\"noopener noreferrer\" target=\"_blank\">National Geographic</a></p><p>9. Niger revealed that thousands of local farmers have planted more than 200 million trees in the last three decades, the largest positive transformation of the environment in African history.&nbsp;<a href=\"https://www.theguardian.com/world/2018/aug/16/regreening-niger-how-magical-gaos-transformed-land\" rel=\"noopener noreferrer\" target=\"_blank\">Guardian</a></p><p>10. Spain said it would create a new marine wildlife reserve for the migrations of whales and dolphins in the Mediterranean and will prohibit all future fossil fuels exploration in the area.&nbsp;<a href=\"https://apnews.com/2b464606b9ac42e8b88718a89908a780?utm_source=The+Crunch&amp;utm_campaign=52c3667cdd-THE_CRUNCH_55_COPY_01&amp;utm_medium=email&amp;utm_term=0_aa18ea5b4e-52c3667cdd-\" rel=\"noopener noreferrer\" target=\"_blank\">Associated Press</a></p>",
      "like": 0,
      "status": "pending",
      "createDate": "2022/04/12 15:22:16",
      "_id": {
        "$oid": "62554bd0433cd9fb47ef2398"
      }
    }
  ],
  "__v": 0
},{
  "_id": {
    "$oid": "62554c27433cd9fb47ef23cf"
  },
  "source_id": {
    "$oid": "62554524d09bc9da6182577f"
  },
  "blog": [
    {
      "title": "New Strength Science Confirms Brain Stimulation Helps Early-Career Handball Players Build Athleticism",
      "image": "http://127.0.0.1:8000/image/16497572235325.png",
      "path": "src\\public\\image\\16497572235325.png",
      "category": "sport",
      "discription": "<h2><strong>The latest peer-reviewed study on tDCS shows that early career-handball players can utilize neuroscience to reach new athletic heights.</strong></h2><p><em>The body of scientific literature on&nbsp;</em><a href=\"https://blog.haloneuro.com/your-optimized-brain-exploring-the-frontier-of-neurostimulation-ee6f611e0c16\" rel=\"noopener noreferrer\" target=\"_blank\"><em>transcranial direct current stimulation</em></a><em>&nbsp;(tDCS) is extensive — since 2003, thousands of papers and tens of thousands of subjects have confirmed the efficacy and safety of combining brain stimulation with training to accelerate improvement. During Halo Neuroscience’s weekly journal club, we review the latest research and understand how it fits within the overall body of work published today.</em></p><p>Hundreds of scientists have published&nbsp;<a href=\"https://www.haloneuro.com/science?utm_source=medium&amp;utm_medium=blog&amp;utm_campaign=Hazime&amp;utm_content=Science\" rel=\"noopener noreferrer\" target=\"_blank\">positive results</a>&nbsp;that conclude that brain stimulation combined with training increases performance, including muscle strength in athletes. In a recent peer-reviewed paper on tDCS, “<a href=\"https://www.ncbi.nlm.nih.gov/pubmed/28593094\" rel=\"noopener noreferrer\" target=\"_blank\">Anodal Transcranial Direct Current Stimulation (tDCS) Increases Isometric Strength of Shoulder Rotators Muscles in Handball Players,”</a>&nbsp;Brazilian scientist Fuad Hazime and his team set out to understand how tDCS affects strength development in shoulder muscles of elite athletes. Hazime and his team’s goal was to expand upon the existing body of literature that focuses primarily on other muscle groups and non-athletes.</p><p>Hazime and colleagues began with a group of experienced, early-career female handball players ages 17–21 — a key point in elite athletic training where the body and brain are largely mature. Because weak rotator cuff muscles predispose handball players to injury, the research team studied the impact of&nbsp;<a href=\"https://www.haloneuro.com/science?utm_source=medium&amp;utm_medium=blog&amp;utm_campaign=Hazime&amp;utm_content=Science\" rel=\"noopener noreferrer\" target=\"_blank\">tDCS</a>&nbsp;over the motor cortex on isometric max strength of the shoulder external and internal rotators.</p><p>Simply put, can brain stimulation before training increase peak strength in young athletes’ shoulder muscles? Short answer, yes — by as much as 20%.</p><h2><strong>Study design and results</strong></h2><p>Like all studies that adhere to the gold standard of scientific research, Hazime’s research was a double-blind, placebo-controlled study. One group of handball players received tDCS and the other received placebo tDCS, which feels like the real thing but does not have an effect on the brain. Neither the researchers nor the athletes knew what type of stimulation they were combining with their training.</p><p>Hazime then tested max shoulder rotator muscle contraction before, during, and both 30 and 60 minutes after stimulation. The following week, the real and placebo stimulation groups switched, and max contraction was assessed once again. This cross-over trial design helps control for imbalances between control and experimental groups, making results more evident.</p>",
      "like": 0,
      "status": "verified",
      "createDate": "2022/04/12 15:23:43",
      "_id": {
        "$oid": "62554c27433cd9fb47ef23d0"
      }
    },
    {
      "title": "The Blockchain Is Going To Change Fantasy Sports Forever",
      "image": "http://127.0.0.1:8000/image/16497572543186.jpeg",
      "path": "src\\public\\image\\16497572543186.jpeg",
      "category": "sport",
      "discription": "<p>What if your fantasy sports experience was all upside and no downside?</p><p>The industry built around fantasy sports — joining a league, picking a lineup of real athletes, and scoring points based on how those players perform in real-world games — faces several challenges that negatively impact one’s enjoyment of this pursuit. Existing platforms like DraftKings and FanDuel are certainly popular, but they are fraught with problems moving money to winners and a general lack of transparency.</p><p>If a fantasy platform could immediately do away with these issues, then it would assert itself as a fan-centric force to be reckoned with.</p><p>Rarely a day goes by in the news cycle without someone reporting on how the blockchain — the technology that powers Bitcoin and similar cryptocurrencies — is changing the way we move money from one corner of the world to another. It operates on an “open ledger” system that is simultaneously super-secure and completely transparent. Blockchain technology doesn’t care about geographical distance or political differences; it just transfers value and information from one user to another, and it does so extremely reliably.</p><p>That’s why MyDFS, the blockchain-powered daily fantasy sports platform, relies on this technology to unite fantasy players around the world and see them compete against each other. Players enter that day’s league and pay an entry fee in MyDFS cryptocurrency tokens. They pick their lineups in the morning, see their results in the evening, and get the corresponding token payout in the same day.</p>",
      "like": 0,
      "status": "verified",
      "createDate": "2022/04/12 15:24:14",
      "_id": {
        "$oid": "62554c46433cd9fb47ef23dd"
      }
    }
  ],
  "__v": 0
},{
  "_id": {
    "$oid": "62554c98433cd9fb47ef241e"
  },
  "source_id": {
    "$oid": "62554199d09bc9da6182574e"
  },
  "blog": [
    {
      "title": "I trained fake news detection AI with >95% accuracy, and almost went crazy",
      "image": "http://127.0.0.1:8000/image/16497573360666.jpeg",
      "path": "src\\public\\image\\16497573360666.jpeg",
      "category": "news",
      "discription": "<p><em>We made a fake news detector with above a 95% accuracy (on a validation set) that uses machine learning and Natural Language Processing that you can download&nbsp;</em><a href=\"https://goo.gl/2cvBmp\" rel=\"noopener noreferrer\" target=\"_blank\"><em>here</em></a><em>. In the real world, the accuracy might be lower, especially as time goes on and the way articles are written changes.</em></p><p>With so many advances in Natural Language Processing and machine learning, I thought maybe, just maybe, I could make a model that could flag news content as fake, and perhaps take a bite out of the devastating&nbsp;<a href=\"http://theconversation.com/the-real-consequences-of-fake-news-81179\" rel=\"noopener noreferrer\" target=\"_blank\">consequences of the proliferation of fake news</a>.</p><p>Arguably the hardest part of making your own machine learning model is gathering the training data. It took me days and days to gather pictures of every&nbsp;<a href=\"https://towardsdatascience.com/5-things-i-learned-training-an-ai-model-on-every-nba-player-32d906b28688\" rel=\"noopener noreferrer\" target=\"_blank\">NBA player in the 2017/2018 season to train a facial recognition model</a>. Little did I know that I’d be diving into a painful, months-long process that exposed some truly dark and disturbing things still being propagated as news and real information.</p><h1>Defining fake news</h1><p>My first obstacle was unexpected. After doing some research into fake news, I very quickly discovered that there are many different categories misinformation can fall into. There are articles that are blatantly false, articles that provide a truthful event but then make some false interpretations, articles that are pseudoscientific, articles that are really just opinion pieces disguised as news, articles that are satirical, and articles that are comprised of mostly tweets and quotes from other people. I Googled around and found some people trying to categorize websites into groups like ‘satire’, ‘fake’, ‘misleading’, etc.</p><p>I thought that was as good as place to start as any, so I went ahead and began visiting these domains to try and hunt for some examples. Almost immediately I found a problem. Some websites that were marked as ‘fake’ or ‘misleading’ sometimes had truthful articles. So I knew that there would be no way to scrape them without doing a&nbsp;<em>sanity</em>&nbsp;check.</p><p>Then I started asking myself if my model should take satire and opinion pieces into account, and if so, should they be considered fake, real, or put into their own category?</p><h1>Sentiment Analysis</h1><p>After about a week of staring at fake news sites, I started to wonder if I was already over-complicating the problem. Maybe I just needed to use some existing machine learning models on sentiment analysis, and see if there was a pattern? I decided to build a quick little tool that used a web scraper to scrape article titles, descriptions, authors, and content and post the results to a sentiment analysis model. I used&nbsp;<a href=\"https://goo.gl/2cvBmp\" rel=\"noopener noreferrer\" target=\"_blank\">Textbox</a>, which was convenient because it ran locally to my machine and returned results quickly.</p><p><a href=\"https://goo.gl/2cvBmp\" rel=\"noopener noreferrer\" target=\"_blank\">Textbox</a>&nbsp;returns a sentiment score which you can interpret as either&nbsp;<em>positive</em>&nbsp;or&nbsp;<em>negative</em>. I then built a crappy little algorithm to add weights to the sentiments of the different types of text I was extracting (title, content, author etc.) and added it all together to see if I could come up with a global score.</p><p>It worked pretty well at first, but after about the 7th or 8th article I tried, it started to fall down. To make a long story short, it was nowhere close to the fake news detecting system I wanted to build.</p>",
      "like": 0,
      "status": "pending",
      "createDate": "2022/04/12 15:25:36",
      "_id": {
        "$oid": "62554c98433cd9fb47ef241f"
      }
    },
    {
      "title": "What do Uber, Volkswagen and Zenefits have in common? They all used hidden code to break the law.",
      "image": "http://127.0.0.1:8000/image/16497573836285.jpeg",
      "path": "src\\public\\image\\16497573836285.jpeg",
      "category": "other",
      "discription": "<p>“No ethically-trained software engineer would ever consent to write a DestroyBaghdad procedure. Basic professional ethics would instead require him to write a DestroyCity procedure, to which Baghdad could be given as a parameter.” — Nathaniel Borenstein</p><h1>Uber used software to illegally operate in hundreds of cities</h1><p>Two hours ago, The New York Times broke the biggest story about Uber yet. Since 2013, Uber has used a sophisticated tool to undermine local law enforcement at every turn.</p><p>The program is called&nbsp;<a href=\"https://www.nytimes.com/2017/03/03/technology/uber-greyball-program-evade-authorities.html?_r=0\" rel=\"noopener noreferrer\" target=\"_blank\">Greyball</a>&nbsp;and it works like this:</p><p>1.&nbsp;&nbsp;&nbsp;&nbsp;In cities where Uber is illegal — of which there are still many — Greyball can identify undercover police who are trying hail Uber drivers, bust their drivers, and impound their vehicles.</p><p>2.&nbsp;&nbsp;When these police open up the Uber app and try to hail a ride, they see phantom Uber cars driving around the city, but they’re never actually able to get a ride.</p><p>3.&nbsp;&nbsp;&nbsp;Since the cars that show up in the app aren’t real, and the police can’t get a driver to pick them up, they can’t bust anyone.</p><p>4.&nbsp;&nbsp;The end result is that Uber can basically ignore the fact that a city hasn’t yet approved ride sharing, and start operating there anyway.</p><p>5.&nbsp;&nbsp;&nbsp;Take a moment to let that sink in. Uber is — thanks to its superior software — essentially above the law.</p><p>6.&nbsp;&nbsp;The way they identify these riders is actually quite genius. Based on the credit cards the police use, Uber can cross-check merchant databases against public servant databases, and figure out who’s likely a cop, then “hell-ban” them from being able to use Uber.</p><p>7.&nbsp;&nbsp;&nbsp;The police officers are never able to successfully hail a ride, but as far as they know, they’re just stuck in the wrong place at the wrong time. That’s how Uber was able to perpetrate this scam for years, until a few Uber engineers with guilty consciences came forward to blow the whistle.</p>",
      "like": 0,
      "status": "verified",
      "createDate": "2022/04/12 15:26:23",
      "_id": {
        "$oid": "62554cc7433cd9fb47ef242c"
      }
    },
    {
      "title": "Background Music for Coding 🎧",
      "image": "http://127.0.0.1:8000/image/16497574315017.jpg",
      "path": "src\\public\\image\\16497574315017.jpg",
      "category": "coding",
      "discription": "<p>by Bradley Nice, Content Manager at&nbsp;<a href=\"https://clickhelp.com/online-documentation-tool/?utm_source=medium-com&amp;utm_medium=brad-top-link&amp;utm_campaign=blogging\" rel=\"noopener noreferrer\" target=\"_blank\">ClickHelp.com — technical documentation tool</a></p><p><strong>UPDATE: There’s now a new, revamped version of this post!</strong></p><h2><a href=\"https://medium.com/@bradley_nice/music-for-programming-2019-edition-6376e90dcebc\" rel=\"noopener noreferrer\" target=\"_blank\">Music for Programming (2019 edition)</a></h2><p>you guys use background music while coding? They say that the right music allows to catch the flow and improve the concentration and performance during the task.</p><p>Today I assembled a list of Youtube videos with music for coding. There you’ll find electronic mixes, ambient sounds, gaming soundtracks and many others. I do hope that you’ll find something that suits your taste ;)</p><p>This video includes soundtracks from video games like Deus Ex, Mirror’s Edge, Half Life 2, System Shock 2 and others. A full list of compositions is available on YouTube in the description to this video.</p><p>Some chill beats and calming sounds here to keep you stress-free and help you catch a creative flow. </p><p>More gaming soundtracks here. Different tracks from Deus Ex, Shadowrun Returns OST, Call of Duty Black Ops 3 and other games will make you feel like a coding hero :)</p>",
      "like": 0,
      "status": "verified",
      "createDate": "2022/04/12 15:27:11",
      "_id": {
        "$oid": "62554cf7433cd9fb47ef243e"
      }
    }
  ],
  "__v": 0
},{
  "_id": {
    "$oid": "62554d3b433cd9fb47ef2474"
  },
  "source_id": {
    "$oid": "6255438bd09bc9da6182575f"
  },
  "blog": [
    {
      "title": "5 Entrepreneurial Lessons from Virat Kohli, the Master Chaser",
      "image": "http://127.0.0.1:8000/image/16497574998727.png",
      "path": "src\\public\\image\\16497574998727.png",
      "category": "sport",
      "discription": "<p>Virat Kohli — a champion and one of the greatest sportsmen of the 21st century — has turned 29 today. A trademark of passion, aggression and hard work, he has been a youth icon and a role model for millions.</p><p>Kohli’s youthful charm, aggression and ‘serious passion’ to his sport, only adds more magic to how he inspires so many cricket lovers. However, the lessons we can learn from him are as relevant in entrepreneurship as in Cricket!</p><p>All the way through his eventful journey in Cricket, Kohli seamlessly blended his entrepreneurial spirit and sport — and we don’t want you to miss how he does it.</p><p>Here are 5 entrepreneurial lessons we can learn from Virat Kohli, the master chaser:</p><h2><strong>1. Believe in Hardwork, Not Shortcuts</strong></h2><p><strong>Irrespective of whether you have talent or not, one has to work hard. Just being talented doesn’t mean anything; you can end up wasting it before you realize. — Virat Kohli</strong></p><p>Cover drive, square cut, pull or hook — you name the batting shot, Virat Kohli has mastered them all. Behind all his success and fame, there’s sweat. There’s self-discipline and endless hours of practice in the nets, improving his fielding skills and rehearsing his strokes! Kohli’s cricketing brain and clever strategies at the hour of need couldn’t have made a big difference without his hard work off screen.</p><p>Startups are emblems of hard work, of course with passion and ambition at their heart. As an entrepreneur, you have to spend enormous amount of time, from ideation to execution and beyond. Success and fame follow the trail of hard work.</p><h2><strong>2. Manage Your Time Insanely Well</strong></h2><p><strong>&nbsp;</strong></p><p><br></p><p>Sometimes, we forget to manage our time — given it is one of the scarcest resources we have — and we tend to do that often. As an entrepreneur, you got to take up many roles and responsibilities that are full of challenges. Managing your time efficiently is key to success.</p><h2><strong>3. Never Stop Learning</strong></h2><p>As an entrepreneur, you are an opportunity-seeker and there’s a huge uncertainty to face throughout your journey. Things will go wrong, you may miss to add that one ingredient or add the wrong one. But, have you learned your lesson? Have you got better at it? Are you ready for the ‘what may come’? That’s what matters!</p><h2><strong>4. Raise Your Own Bar</strong></h2><p>Anyone would agree that Virat Kohli has been breaking boundaries, astounding every one. Take the example of how he brought a paradigm shift in how fitness is viewed in Indian cricket. His unusual training methods shock others, making him one of the fittest cricketers in India.</p><p><br></p><h2><strong>5. Be Adaptable and Consistent</strong></h2><p>No matter what’s the format, Kohli maintains a consistent batting average — be it ODI (55.74), T20I (53.97) or Test (49.55). Kohli adapts himself with the kind of format and gives his best. He never lets the changing conditions bring his performance down!</p>",
      "like": 0,
      "status": "verified",
      "createDate": "2022/04/12 15:28:19",
      "_id": {
        "$oid": "62554d3b433cd9fb47ef2475"
      }
    },
    {
      "title": "SHAUN KING: A Private Law Enforcement Group on Facebook is Literally Plotting to Kill Me",
      "image": "http://127.0.0.1:8000/image/16497575383646.png",
      "path": "src\\public\\image\\16497575383646.png",
      "category": "other",
      "discription": "<p>On this past Tuesday morning I received a very alarming text message from a friend. Inside of a private Facebook group for California Law Enforcement Officers, members of the group were openly plotting and planning my assassination.</p><p>Sadly, I receive death threats daily. It’s been that for years, but they are mainly from anonymous strangers and seem more designed to intimidate me and my family than they appear to be imminent threats of physical harm. We take them all seriously, but what we found in this private Facebook group is altogether different. These were men and women, in a private group that they had no idea I’d ever see, using their real names and identities, openly plotting to kill me and organizing each other to execute it.</p><p>Who do you call to report the misconduct of current or retired law enforcement officers? Because I lack confidence in any law enforcement system to handle this, I feel the burden to release this publicly for my own safety and for the safety of my family.</p><p>Below I will include the screenshots and details of the threats.</p><p>It started with retired Long Beach Police officer&nbsp;<a href=\"https://www.facebook.com/laura.tartaglione.54\" rel=\"noopener noreferrer\" target=\"_blank\">Laura Tartaglione</a>&nbsp;saying “I think California needs to start putting a team together of retired military, police, and NRA Members. These criminals that the Democrats created need to be stopped.”</p>",
      "like": 0,
      "status": "verified",
      "createDate": "2022/04/12 15:28:58",
      "_id": {
        "$oid": "62554d62433cd9fb47ef2482"
      }
    },
    {
      "title": "Breaking news",
      "image": "http://127.0.0.1:8000/image/16497576038047.png",
      "path": "src\\public\\image\\16497576038047.png",
      "category": "news",
      "discription": "<p>Many investors in BTC dread the month of September.</p><p><em>Why?</em></p><p>Because even during the bullish years of 2017 and 2020, there were market corrections of — 8.25% and — 7.53% respectively, in September.</p><p>So, September will be a prohibited month for many bullish investors. However, experienced investors know that historical performance is not a precursor for future predictions. This year is set to witness an explosive revolution of DeFi, all thanks to KeplerSwap.</p><p>This project is about to take over the DeFi sector with its ground-breaking concepts. Whether Bitcoin likes September or not, KeplerSwap will show users through tremendous energy how the new DeFi 2.0 ecosystem can shatter all expectations.</p><p>We have all deduced from the KeplerSwap weekly report of last week that the team has continued to hold multiple AMA Events and will carry out additional AMAs over the next 2–3 weeks.</p><p>The first token to go live at KeplerSwap will be SDS (Seeds token), which will create numerous cryptographic market opportunities for the ecological environment.</p><p>In the early days of UniSwap, UNI was a huge success as an initial token, contributing significantly to the development of DEX in DeFi 1.0.</p><p>Now that UNI has accomplished its mission, all this will not be simply repeated in the next DeFi 2.0 ecology as more significant changes are taking place for a vibrant and promising ecology… Keplerswap is undoubtedly the most exciting project in DeFi!</p><p><strong><em>Does anyone remember UNI’s performance over the past year?</em></strong></p><p>From the initial $0.48 to today’s $22, or even up to $40; this huge increase is unimaginable. If you continue to have confidence in UNI, I believe that the DeFi 1.0 sector will continue to rise, driven by DeFi2.0.</p><p>Let’s assume that after a month of KeplerSwap going live; how much will SDS cost down the line; three months from now, six months from now, a year from now?</p><p>This is certainly something to look forward to!</p><p>Why are the stars of KeplerSwap SDS so bright?</p><p>KeplerSwap is a professional decentralized trading platform on the Binance Smart Chain; it is the first decentralized exchange under DeFi 2.0 structure. This stems from its extremely well-developed application ecology. Besides having full access to DeFi 1.0 services, according to the KeplerSwap Whitepaper, an owner of SDS can participate in features, which include:</p><p>- Governance tokens;</p><p>- Liquidity market-making;</p><p>- LUCKYPOOL rewards;</p><p>- Intelligent aggregation;</p><p>- Creating SPACE and voting;</p><p>- Obtain airdrops;</p><p>- And other redeeming benefits (refer to the Whitepaper)</p>",
      "like": 0,
      "status": "verified",
      "createDate": "2022/04/12 15:30:03",
      "_id": {
        "$oid": "62554da3433cd9fb47ef2494"
      }
    }
  ],
  "__v": 0
},{
  "_id": {
    "$oid": "62554f0cf505e215be0e857a"
  },
  "source_id": {
    "$oid": "62554586d09bc9da61825787"
  },
  "blog": [
    {
      "title": "15 Tools That Will Help You Build Your Website (No Coding Required)",
      "image": "http://127.0.0.1:8000/image/16497579644778.jpeg",
      "path": "src\\public\\image\\16497579644778.jpeg",
      "category": "coding",
      "discription": "<p>So many ideas, so little time (or coding ability)! If you’re ready to launch a new website for your startup, personal blog, portfolio, or anything else, getting things up and running can often be a daunting and expensive process. We put together a collection of 15 tools to help you build and launch your next website—even if you have limited or no coding or design experience. Check out the list below; one or many of these should help you get started quickly. We can’t wait to see what you build. :-)</p><p>S</p><h2><a href=\"https://www.producthunt.com/tech/carrd\" rel=\"noopener noreferrer\" target=\"_blank\">1. Carrd</a></h2><p><strong>Simple, responsive, one-page sites for pretty much anything.</strong></p><p><br></p><p><a href=\"https://www.producthunt.com/tech/carrd\" rel=\"noopener noreferrer\" target=\"_blank\"><img src=\"https://miro.medium.com/max/875/1*TzA_iglZVklrNlCHq1VH0A.png\"></a></p><p>A free service for building and hosting simple, responsive, one-page websites for anything and everything. There are a bunch of other sites that help you build out one-pagers, but the biggest differentiator here is the simplicity and easy of use, while not compromising on your ability to create a functional and beautifully designed website.</p><h2><a href=\"https://www.producthunt.com/tech/template-stash\" rel=\"noopener noreferrer\" target=\"_blank\">2. Template Stash</a></h2><p><strong>Curated collection of best free themes &amp; website templates.</strong></p><p><br></p><p><a href=\"https://www.producthunt.com/tech/template-stash\" rel=\"noopener noreferrer\" target=\"_blank\"><img src=\"https://miro.medium.com/max/875/1*6-o6HUmX4ooXgdfglTq6hg.png\"></a></p><p>A curated collection of the best free website templates. Each one is evaluated based on: visual appeal, ease of customization, and functionality. You can search for what you’re looking for by category, keyword, and creator, which makes it easy to find exactly what you’re looking for. Bonus: There are also collections dedicated to specific design trends, like “material design” and “modern portfolio.”</p><h2><a href=\"https://www.producthunt.com/tech/bubble-3\" rel=\"noopener noreferrer\" target=\"_blank\">3. Bubble</a></h2><p><strong>Build a fully functional web app without any code.</strong></p><p><br></p><p><a href=\"https://www.producthunt.com/tech/bubble-3\" rel=\"noopener noreferrer\" target=\"_blank\"><img src=\"https://miro.medium.com/max/875/1*Hkg8pUQVYey3YnkNXRluXw.png\"></a></p><p>Without any code knowledge, this tool helps you build web and mobile applications. The intuitive drag and drop builder allows you to easily add page elements like: text, videos, maps, icons, images, buttons, and more. Everything is customizable, down to font colors, icons, and the visibility of various elements based on what’s going on in the app you design.</p><h2><a href=\"https://www.producthunt.com/tech/html-to-wordpress\" rel=\"noopener noreferrer\" target=\"_blank\">4. HTML to WordPress</a></h2><p><strong>Convert HTML website to WordPress theme in seconds.</strong></p><p><br></p><p><a href=\"https://www.producthunt.com/tech/html-to-wordpress\" rel=\"noopener noreferrer\" target=\"_blank\"><img src=\"https://miro.medium.com/max/875/1*Rw9fKP4YnwsYr-kGsd-Yhw.png\"></a></p><p>This tool converts static HTML websites into WordPress. If you’re looking to switch your site over, this will help you automate a lot of the manual work. Just upload a website into the tool and after a few seconds, it’ll convert into a fully functional, premium quality WordPress theme—activated and installed. All of the designers and developers, rejoice!</p><h2><a href=\"https://www.producthunt.com/tech/tilda-publishing\" rel=\"noopener noreferrer\" target=\"_blank\">5. Tilda Publishing</a></h2><p><strong>Build beautiful websites and tell stories without any code.</strong></p><p><br></p><p><a href=\"https://www.producthunt.com/tech/tilda-publishing\" rel=\"noopener noreferrer\" target=\"_blank\"><img src=\"https://miro.medium.com/max/875/1*A_sZ0zg1S5n0Ad3Ixhz27A.gif\"></a></p><p>A<strong>&nbsp;</strong>website building platform geared toward content-oriented sites. There are over 170 pre-designed blocks that enable you to drag and drop your way toward a fully customizable website. All pages you create with this tool are built to look great across all devices, which is a nice thing to not have to worry about if you’re not a coder. This is a fantastic option for those looking to build blogs, lookbooks, event reports, and more.</p><h2><a href=\"https://www.producthunt.com/tech/xprs\" rel=\"noopener noreferrer\" target=\"_blank\">6. XPRS</a></h2><p><strong>Free website builder — making web design like Lego™. No code.</strong></p><p><br></p><p><a href=\"https://www.producthunt.com/tech/xprs\" rel=\"noopener noreferrer\" target=\"_blank\"><img src=\"https://miro.medium.com/max/875/1*fhUjec4De9NjeehkyxZMWg.jpeg\"></a></p><p><br></p><h2><a href=\"https://www.producthunt.com/tech/grav-1-0\" rel=\"noopener noreferrer\" target=\"_blank\">7. Grav</a></h2><p><strong>Modern open source flat-file CMS to build faster websites.</strong></p><p><br></p><p><a href=\"https://www.producthunt.com/tech/grav-1-0\" rel=\"noopener noreferrer\" target=\"_blank\"><img src=\"https://miro.medium.com/max/875/1*lq1hUzV4vkxttM3bBjJw9g.png\"></a></p><p>A more complex tool, built for developers with some experience. This open source flat-file CMS allows you to build faster websites. The idea: With static HTML pages, you can’t do anything dynamic like query data, edit content via an admin interface, process forms, etc. Grav is “processed at runtime,” allowing you to do the same things you could do with Drupal, Joomla, or WordPress. There are&nbsp;<a href=\"https://getgrav.org/features\" rel=\"noopener noreferrer\" target=\"_blank\">countless features</a>, including: site-wide and per-page routing and redirection, a visual debug panel, multi-language support, flexible taxonomies, a built-in asset manager, and much more.</p><h2><a href=\"https://www.producthunt.com/tech/pivot-2\" rel=\"noopener noreferrer\" target=\"_blank\">8. Pivot</a></h2><p><strong>Drag and drop real-time HTML page building.</strong></p><p><br></p><p><a href=\"https://www.producthunt.com/tech/pivot-2\" rel=\"noopener noreferrer\" target=\"_blank\"><img src=\"https://miro.medium.com/max/875/1*l_-J9XuWLV6u8-w7MqNrRw.png\"></a></p><p>This block-based, multi-purpose HTML 5 template allows you to choose from over 70 uniquely styled content blocks for incredible customizability. You can build web pages in minutes and manage site navigation, sliders, images, text, maps, color schemes, and more—all from your browser. Great for multiple uses, from a product launch to a personal portfolio website.</p><h2><a href=\"https://www.producthunt.com/tech/hype-3-0\" rel=\"noopener noreferrer\" target=\"_blank\">9. Hype 3.0</a></h2><p><strong>Create beautiful HTML5 web content, no coding required.</strong></p><p><br></p><p><a href=\"https://www.producthunt.com/tech/hype-3-0\" rel=\"noopener noreferrer\" target=\"_blank\"><img src=\"https://miro.medium.com/max/875/1*uo7m9-QYcnvCWBtJiAoKjQ.png\"></a></p><p>This keyframe-based animation system makes your content come alive. Just click “record” and Hype watches your every move, automatically creating keyframes as needed. You can also add, remove, and rearrange keyframes manually if you want more control. This is an incredible tool if you’re looking to animate anything from web pages and infographics, to eBooks and presentations. Prepare to be wowed.</p><h2><a href=\"https://www.producthunt.com/tech/onepager\" rel=\"noopener noreferrer\" target=\"_blank\">10. OnePager</a></h2><p><strong>One page theme builder for WordPress.</strong></p><p><br></p><p><a href=\"https://www.producthunt.com/tech/onepager\" rel=\"noopener noreferrer\" target=\"_blank\"><img src=\"https://miro.medium.com/max/875/1*MYDbDbd2peITkzcNrQgG9Q.jpeg\"></a></p><p>This open source theme builder allows you to quickly edit everything on your web page on the fly. It’s effortless to build out a fully responsive, SEO-friendly site with built-in presets to kickstart your site development. Just about everything is customizable, allowing you to tailor the look and feel of your site exactly the way you want it. A great tool for anyone looking to build a WordPress site quickly.</p>",
      "like": 0,
      "status": "verified",
      "createDate": "2022/04/12 15:36:04",
      "_id": {
        "$oid": "62554f0cf505e215be0e857b"
      }
    }
  ],
  "__v": 0
},{
  "_id": {
    "$oid": "62554f96f505e215be0e85be"
  },
  "source_id": {
    "$oid": "6255416ad09bc9da6182574a"
  },
  "blog": [
    {
      "title": "Apple Music: A UX/UI Holistic Case Study",
      "image": "http://127.0.0.1:8000/image/16497581022708.jpeg",
      "path": "src\\public\\image\\16497581022708.jpeg",
      "category": "other",
      "discription": "<p>Apple Music is relatively new on the music streaming scene. I subscribed from day one because A) it was integrated to the Apple ecosystem I was using everyday and B) I was conscious it was far from ideal but also curious to see how Apple would polish this and infuse their traditional design expertise.</p><p>And this is slowly happening, the mobile app is driving every design iteration as new waves of users keep flowing in but it still feels clunky sometimes, and the desktop app especially needs a solid update. So I’ve been mainly focusing my attention on the Desktop app, but further down you will find some mobile screens as well.</p><p>I’ve been using the app for a while now so this case study is mainly based on my own assumptions. However, about design and experience, I also talked to people and read many feedbacks.</p><p><br></p><p><br></p><p>A few common feedbacks:</p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;“<em>Outdated iTunes layout on desktop</em>”</p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;“<em>Too little emphasis on the user’s own music library and too much emphasis on always recommending something new.</em>”</p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;“<em>I don’t listen to today’s music and there’s a lot of it, I’d rather not see it.</em>”</p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;“<em>My recommendations are full of artists I have no interest in. Also very heavily in only one genre of music.</em>”</p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;“<em>The Music app is full of some slightly confusing behaviours.</em>”</p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;“<em>Having a little bit of personality doesn’t hurt.</em>”</p><p>Here’s what I tried to stick to:</p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Harmonise, Desktop and Mobile should look like one</p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Create something you would like to use yourself</p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Keep the big picture in mind, think about all the devices out there before you give a go to an idea</p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Keep it simple, remove anytime possible</p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Make it feel personal, introduce customisation</p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Don’t ever go and check what other Music Streaming Services do</p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Don’t ever go and check what fellow Digital Designers did</p>",
      "like": 0,
      "status": "verified",
      "createDate": "2022/04/12 15:38:22",
      "_id": {
        "$oid": "62554f96f505e215be0e85bf"
      }
    },
    {
      "title": "Following Messi with TensorFlow and Object Detection",
      "image": "http://127.0.0.1:8000/image/16497581581868.jpeg",
      "path": "src\\public\\image\\16497581581868.jpeg",
      "category": "sport",
      "discription": "<p>In previous publications we were using&nbsp;<a href=\"https://www.tensorflow.org/\" rel=\"noopener noreferrer\" target=\"_blank\">TensorFlow</a>&nbsp;in combination with the&nbsp;<a href=\"https://github.com/tensorflow/models/tree/master/research/object_detection\" rel=\"noopener noreferrer\" target=\"_blank\">Object Detection</a>&nbsp;model, but always making use of the traditional pre-established datasets [example&nbsp;<a href=\"http://cocodataset.org/#home\" rel=\"noopener noreferrer\" target=\"_blank\">COCO database</a>]. This time our challenge should take us another level and I will propose analyze a segment of a soccer game and identify its players [at least one of them].</p><p>When talking about soccer, the first thing that came to mind is look for the talented Argentinian star Lionel Messi. I will propose something:</p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Let’s train a personalized model that allows us to locate Argentine star.</p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Let’s analyze a real transmission [in this case I selected Uruguay-Argentina by Conmebol qualifying August 31, 2017] to see what results we can get.</p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Let us think if it is possible to improve or contribute something to the tactics of this passionate sport, using this technology.</p><p>Note: We will use&nbsp;<a href=\"https://www.tensorflow.org/\" rel=\"noopener noreferrer\" target=\"_blank\">TensorFlow</a>&nbsp;and the proposed model for&nbsp;<a href=\"https://github.com/tensorflow/models/tree/master/research/object_detection\" rel=\"noopener noreferrer\" target=\"_blank\">Object Detection</a>, all under the Apache License 2.0 license.</p><p>In this opportunity I will start by showing you the result obtained:</p><p>If you find them interesting, I invite you to dedicate a few more minutes to follow the step by step to understand the procedure of building this model.</p><p>We should complete three important&nbsp;<em>moments</em>:</p><p>1.&nbsp;&nbsp;&nbsp;&nbsp;Build the&nbsp;<strong>custom dataset</strong>&nbsp;with the objects to be detected. [in this case Lionel Messi in full action].</p><p>2.&nbsp;&nbsp;<strong>Train and evaluate</strong>&nbsp;the model using TensorFlow.</p><p>3.&nbsp;&nbsp;&nbsp;<strong>Use</strong>&nbsp;the created model.</p>",
      "like": 0,
      "status": "verified",
      "createDate": "2022/04/12 15:39:18",
      "_id": {
        "$oid": "62554fcef505e215be0e85e4"
      }
    }
  ],
  "__v": 0
},{
  "_id": {
    "$oid": "6255501ef505e215be0e861b"
  },
  "source_id": {
    "$oid": "62554463d09bc9da6182576f"
  },
  "blog": [
    {
      "title": "The Beginners Guide to Composition in Food Photography: How to Transform your Food Photos from Good to Bloody Beautiful",
      "image": "http://127.0.0.1:8000/image/16497582383749.jpeg",
      "path": "src\\public\\image\\16497582383749.jpeg",
      "category": "other",
      "discription": "<p><a href=\"http://www.davidlebovitz.com/2011/02/food-blogging-food-blog/\" rel=\"noopener noreferrer\" target=\"_blank\"><em>Use photos to tell the story. A nice picture is one thing, but your photos should augment the text, or vice-versa — David Lebovitz</em></a></p><p>Don’t you agree? And this telling a story aspect is where composition comes in.</p><p>Firstly, we need to understand what composition is. Like the word is generally used, it is how all the elements that form the final product are used.</p><p><em>Composition is a way of guiding the viewer’s eye towards the most important elements of your work, sometimes — in a very specific order. A good composition can help make a masterpiece even out of the dullest objects and subjects in the plainest of environments. On the other hand, a bad composition can ruin a photograph completely, despite how interesting the subject may be. —&nbsp;</em><a href=\"https://photographylife.com/what-is-composition-in-photography\" rel=\"noopener noreferrer\" target=\"_blank\">Photography Life</a></p><p>And the secret behind great composition? Making it look effortless. The composition should be seamless, so that the focus is on the food itself and not what was going on in the mind of the photographer.</p><p><a href=\"http://www.passionateaboutbaking.com/\" rel=\"noopener noreferrer\" target=\"_blank\"><strong>Deeba Rajpal,</strong></a><strong>&nbsp;one of my absolute favourites, when it comes to composition, puts her thoughts on composition across in such a sublime way.</strong></p><p><em>Food styling and composition for me is a very connected and therapeutic process, and something I immensely enjoy. I have experienced however that if I don’t enjoy styling, making or tasting what I’ve made, the joy in styling and shooting is somewhat diluted. The results speak! So, I feel, it is important to have a passion and to be in sync with what you plan to shoot. Also, that we grow with each shot, every ‘image’ is another step in the learning curve. I really love shooting dark, moody images, but sometimes I chase light rather than block it!</em></p><p>There you have it. This is precisely why you sometimes need to go with the flow for your compositions.</p><p>In my mind, there are two ways you can approach composition.</p><p>Either your composition is telling you a story and making you think about the picture.</p><p>Or it needs to present the image in the best way possible.</p><p>Since I’m one for pictures that talk to you, here is one of my recent favourites in terms of composition. Sandhya of&nbsp;<a href=\"http://sandhyas-kitchen.blogspot.in/\" rel=\"noopener noreferrer\" target=\"_blank\">Sandhya’s Kitchen</a>&nbsp;fame creates such a beautiful picture that instantly evokes a story in your mind.</p>",
      "like": 0,
      "status": "verified",
      "createDate": "2022/04/12 15:40:38",
      "_id": {
        "$oid": "6255501ef505e215be0e861c"
      }
    }
  ],
  "__v": 0
},{
  "_id": {
    "$oid": "625550eef505e215be0e8646"
  },
  "source_id": {
    "$oid": "6255441fd09bc9da61825767"
  },
  "blog": [
    {
      "title": "WWE’s Talent Raiding Season Is Soon, But Who’s Likely to Leave?",
      "image": "http://127.0.0.1:8000/image/16497584462649.jpeg",
      "path": "src\\public\\image\\16497584462649.jpeg",
      "category": "sport",
      "discription": "<p>It’s that wonderful time of the year. No, not Christmas. WWE’s raiding season. See, the way things are set up in the indies, namely Ring of Honor and New Japan Pro Wrestling, is that wrestlers are usually on short term contracts that all expire at the end of — or in NJPW’s case, top of — the year. It’s convenient for the talent, but also a bad sign for the company when Vince McMahon’s pockets run deeper than the Springfield Gorge.</p><p>Just like when Homer tried to jump over the Gorge, both companies will end up being pretty hurt by the unstoppable force. With raid season around the corner, who is likely to be departing for the chance at becoming a superstar in the WWE?</p><p><strong>Note:</strong>&nbsp;The Young Bucks&nbsp;<a href=\"https://twitter.com/MattJackson13/status/805197292085055488\" rel=\"noopener noreferrer\" target=\"_blank\">recently signed</a>&nbsp;another two-year deal with ROH/NJPW.</p><p>&nbsp;</p><p>Steve Corino is ROH. He helped build the place by putting on epic showdowns with Kevin Steen (Kevin Owens in WWE) and Homicide, and was a great commentator alongside Kevin Kelly. His wrestling years are long behind him, and there’s a lot he has to offer in the role of a coach. WWE is reportedly scouting tough to secure him for the Performance Center, but nothing can officially happen until his contract is up. NXT would benefit a great deal under the guidance of Coach Corino.</p><p>What’s there left to conquer in ROH? He was a reigning world title holder for over a year, held the TV title around the same time, and has faced off against everybody there is. At 31 years old, the time for Lethal to make an attempt at WWE fame is now. He’s younger than Samoa Joe and Shinsuke Nakamura, and the exact face — now that he shed the braids — that NXT needs in order for others to move up to the main roster.</p>",
      "like": 0,
      "status": "verified",
      "createDate": "2022/04/12 15:44:06",
      "_id": {
        "$oid": "625550eef505e215be0e8647"
      }
    }
  ],
  "__v": 0
},{
  "_id": {
    "$oid": "62555174f505e215be0e866c"
  },
  "source_id": {
    "$oid": "625544b0d09bc9da61825777"
  },
  "blog": [
    {
      "title": "Designing a CSA food app in 3 days — a UX case study",
      "image": "http://127.0.0.1:8000/image/164975858076010.png",
      "path": "src\\public\\image\\164975858076010.png",
      "category": "other",
      "discription": "<p>A couple of weeks back I was tasked with designing a digital solution for the food industry. Now here’s the catch: it had to be done in less than three days. If you are familiar with&nbsp;<a href=\"https://designsprintkit.withgoogle.com/introduction/overview\" rel=\"noopener noreferrer\" target=\"_blank\">GV’s Design Sprint</a>&nbsp;then you understand&nbsp;<strong>this is actually possible</strong>. I found this a great opportunity to document a step-by-step guide to designing an app in just 24 business hours. In this article I will break down my process and the design phases for each day.</p><h1>Background</h1><p>Common Food is a farm that uses Community Supported Agriculture (CSA) to sell their vegetables and fruits. They sell shares of their farm that people pre-pay for at the beginning of the year. Each week during the growing season community members receive a box of food.</p><p><br></p><h1>Challenge</h1><p>Design a digital experience that will help Common Food Farm sell its extra food each week to its shareholders. Help the shareholders find extra food considering their varying knowledge, interest and dietary constraints.</p><h1>Day 1: Learn</h1><h2>Research Methods</h2><p>The research phase tends to take up some time so any existing information I have at hand is a great way to save time. Marketing material, competitors, user surveys or if it’s an existing app reading user reviews in the app store so I start getting in that user mindset early on.</p><p><br></p><h2>Surveys</h2><p>Common Food surveys their shareholders at the end of every season to better understand them. Here is some of this year’s feedback</p><p><br></p><blockquote><em>“I LOVE cooking and canning. Love it! Can I get some more of those heirloom tomatoes?!”</em></blockquote><blockquote><em>“What is kohlrabi? I just threw it away. The lettuce was great though.”</em></blockquote><blockquote><em>“My son is allergic to broccoli so we never use that. I don’t know what to do with the garlic scapes.”</em></blockquote><blockquote><em>“I wish I had more kohlrabi! I like to turn it into kimchi.”</em></blockquote><blockquote><em>“&nbsp;I keep telling you — we have to get more CSAs out there! Big Farm is not stopping. Everywhere I look I see more genetically modified monster crops! We need to support getting this out to the people …. (continues) ….”</em></blockquote><blockquote><em>“Is there a way we could get more beets?”</em></blockquote><blockquote><em>“I’ve never heard of bok choi before. It looks pretty but I am not sure how to cook it.”</em></blockquote><p><a href=\"https://info.fieldagent.net/the-digital-shopper\" rel=\"noopener noreferrer\" target=\"_blank\">A new report from Field Agent</a>&nbsp;finds that produce is a popular category for online grocery shoppers in both planned and unplanned purchases. Sixty-five percent of the consumers surveyed said they bought fresh produce, making it the top choice along with chilled dairy products. Thirty-one percent said they bought fresh fruits and vegetables on impulse, beating out snacks (23%) and candy (14%).&nbsp;<strong>However, 39% of digital shoppers didn’t buy fresh produce online because they prefer to inspect it in person.</strong>&nbsp;Source:&nbsp;<a href=\"https://www.grocerydive.com/news/grocery--survey-most-online-grocery-shoppers-buy-produce/534080/\" rel=\"noopener noreferrer\" target=\"_blank\">Grocery Dive</a></p><h2>Market Research</h2><p>Although consumers are increasingly turning online to buy groceries, just one in 10 Americans buy fresh produce, meat, poultry and fish through e-commerce,&nbsp;<a href=\"https://www.foodnavigator-usa.com/Article/2018/05/22/Consumers-have-trust-issues-when-it-comes-to-online-shopping-that-can-be-remedied-says-Mintel\" rel=\"noopener noreferrer\" target=\"_blank\">market research company Mintel found</a>.&nbsp;<strong>To counteract consumer hesitation and improve sales, grocers should promote cost savings and provide in-depth product information to build trust and convey quality</strong>, the research suggests. Also reordering options like Amazon’s “Subscribe and Save” ​are an appealing feature to busy consumers, especially women (48%) who are more likely than men (37%) to make online food or drink purchases. Source:&nbsp;<a href=\"https://www.grocerydive.com/news/grocery--consumers-still-hesitate-to-buy-fresh-produce-online/533989/\" rel=\"noopener noreferrer\" target=\"_blank\">Grocery Dive</a></p><p><br></p><h2>How Might We’s (Brainstorming)</h2><p><img src=\"https://miro.medium.com/max/875/1*Ms6z5wK4isqWTCdPuNK1Cg.gif\"></p><p>How Might We Questions</p><p><em>How might we reduce waste and allocate foods by collecting data from our shareholders?</em></p><p><em>How might we sell extra food each week through seasonal recipes and promotions?</em></p><p><em>How might we help the shareholders find extra food based on their dietary preferences?</em></p><h2>User Personas</h2><p>The results from the user survey provided sufficient information to create user personas. I opted for creating age and gender agnostic personas to focus on achieving user goals equally regardless of age and gender.</p><p><br></p><p><img src=\"https://miro.medium.com/max/858/1*RN1A3ZlM1OqSLigO8w5m7A.png\"></p><p><img src=\"https://miro.medium.com/max/858/1*W9tX72rbQfeFlWCi2FbSRQ.png\"></p><p><img src=\"https://miro.medium.com/max/858/1*0NbsPC9RNrwOdJooaJkbWw.png\"></p><p>User Personas</p><h2>Comparable Problem</h2><p>Once I am ready to enter the sketching phase I research a similar problem and solution that exists in similar industries or from direct competitors to identify best practices.</p><p><br></p><p><strong>Box size and content variety</strong></p><p><a href=\"https://www.farmboxdirect.com/\" rel=\"noopener noreferrer\" target=\"_blank\">FarmBox Direct</a>&nbsp;and&nbsp;<a href=\"http://www.farmfreshtoyou.com/\" rel=\"noopener noreferrer\" target=\"_blank\">Farm Fresh to you</a>&nbsp;offer different box sizes and different produce options.</p><p><img src=\"https://miro.medium.com/max/875/1*XtXfW_QkiJm67sc5UBT69w.gif\"></p><p><strong>Customize box content</strong></p><p><a href=\"http://www.farmfreshtoyou.com/\" rel=\"noopener noreferrer\" target=\"_blank\">FarmFresh to you&nbsp;</a>lets you customize your box, add or remove produce and set quantity of an item. You must pay for your box before you can customize it. You can also create lists for items to exclude.</p><p><img src=\"https://miro.medium.com/max/875/1*QoSFXicvtPonj1KrkRS5ZQ.gif\"></p><p>FarmFresh to You</p><p><strong>Authentic Photography</strong></p><p><a href=\"https://www.farmsteadapp.com/\" rel=\"noopener noreferrer\" target=\"_blank\">Farmstead</a>&nbsp;lets you add as many items as you wish to your box (as its not subscription based) you can add, remove and browse items than checkout once you are fully satisfied. Farmstead offers authentic fresh photography of produce unlike the other competitors who use stock photos.</p><p><img src=\"https://miro.medium.com/max/875/1*xi4k4fOdh0SQr_JNNCQtMA.gif\"></p><h2>Approach</h2><p>My approach is to design an app to collect data from shareholders, such as household size, dietary preferences and constraints in order to recommend seasonal food crates that shareholders can easily customize. Using Artificial intelligence to learn about the food habits of shareholders to provide recipes, food suggestions and targeted promotions to help find and sell extra food. Test which combinations are the best for a specific dietary preference and make suggestions. This received data helps to get feedback from shareholders we can then find out what type of produce or combinations users keep reordering and what produce they actually like the most during what season.</p><h1>Day 2: Sketch and Design</h1><p>I like to start sketching right of the back as soon as I feel I kind of “get it”, I sketch a lot I like to get all the bad ideas out of the way and keep what works best.&nbsp;<strong>I map out the journey and from there I define user, task, and goal specific journeys.</strong></p><p><br></p><p><img src=\"https://miro.medium.com/max/875/1*YSnF8KvTYQ_NZTKlSQMSWg.gif\"></p><h2>User Journey</h2><p>Having settled my user personas, comparable problem, and initial sketches. I set forth to design a journey for an existing shareholders who already subscribed to the service and is placing an order for the first time through the mobile app, hence we already have the user’s schedule, shipping and billing information in our database. Once all this is done I’m ready to start wireframing.</p><p><br></p><p><img src=\"https://miro.medium.com/max/875/1*Wmo1boiQRR5d5BdP1GHNtg.png\"></p><h2>Wireframes</h2><p>Wireframes are a skeleton view of the app or as I like to call it the&nbsp;<em>bones</em>&nbsp;this allows me to focus on key functions, elements, and actions before starting on visual design or putting on some&nbsp;<em>skin</em>. I opted for High-Fidelity wireframes this way I just have to splash on some color and place images and icons.</p><p><br></p><p><img src=\"https://miro.medium.com/max/875/1*_Hg-udhB-mJQTQklpddIVw.png\"></p><h2>Visual References</h2><p>After wireframing I look for visual references within the industry for my moodboard.</p><p><br></p><p><img src=\"https://miro.medium.com/max/875/1*gbQny6v2MpS5A1UcvNnUVg.jpeg\"></p><h2>Color Scheme</h2><p>I went for a bright red color scheme. Bright colors create appetite and red is also a color that triggers shopping (Sales, promos, clearance etc.)</p><p><br></p><p><img src=\"https://miro.medium.com/max/875/1*UY6O3KRtyFU5VrlZ0FhhjA.png\"></p><h2>Typography</h2><p><img src=\"https://miro.medium.com/max/750/1*DgneAV-EFCAHrmkpJwEkOw.png\"></p><h2>Iconography</h2><p>When it comes to icons and saving I time I don't recommended drawing them out. As much as I enjoy illustrating my own icons time is not on my side right now. I recommended an icon library like&nbsp;<a href=\"https://material.io/tools/icons/\" rel=\"noopener noreferrer\" target=\"_blank\">Material Design icons</a>&nbsp;or as I used for this app&nbsp;<a href=\"https://thenounproject.com/\" rel=\"noopener noreferrer\" target=\"_blank\">The Noun Project</a>. However, The Noun Project requires a subscription to be able to fully customize their icons if you don’t purchase a subscription you must give the author attribution.</p><p><br></p><p><img src=\"https://miro.medium.com/max/750/1*nUfRQLyDl-75WG_eKnCFgQ.png\"></p><h2>Logotype</h2><p>I wanted an obvious name but also a significant logo so FarmCrate was the best choice for the name once I thought of that I though a crate as a logo and soon after some iterations I came up with combining a farm and a crate.</p><p><br></p><p><img src=\"https://miro.medium.com/max/750/1*_zuQV5rdU5ORf5W4FTkx0A.png\"></p><h2>Design Variations</h2><p>I like to try out different styles and design variations I try not to settle for the first option and iterate until I find a common ground in my design.</p><p><br></p><p><img src=\"https://miro.medium.com/max/875/1*DptHNQc4VT8XNGayA_3vkA.png\"></p>",
      "like": 0,
      "status": "verified",
      "createDate": "2022/04/12 15:46:20",
      "_id": {
        "$oid": "62555174f505e215be0e866d"
      }
    }
  ],
  "__v": 0
},{
  "_id": {
    "$oid": "625639eb542f678cfadaa550"
  },
  "source_id": {
    "$oid": "625638a4542f678cfadaa512"
  },
  "blog": [
    {
      "title": "Drag and Drop in React",
      "image": "http://127.0.0.1:8000/image/164981809150811.png",
      "path": "src\\public\\image\\164981809150811.png",
      "category": "coding",
      "discription": "<h1>Introduction</h1><p><strong>The drag and drop is one the most basic and important actions a person learns when they are first introduced to a computer with a GUI (Graphical User Interface). The first time I remember performing the action is back on my PC running Windows 95 when I dragged a file over my Trash Bin Icon and dropped it in, effectively deleting the file.</strong></p><p><br></p><p>The premise has not changed much since then. At its base simplicity, the steps are as follows:</p><ol><li>Use your mouse/trackpad/finger to click and hold on an object</li><li>While continuing to hold drag that object to another part of the screen where a second target object is located</li><li>Once the object being dragged it over the target object, release and drop it into the target container, which will perform some action.</li></ol><p><br></p><h1>Implementing Drag and Drop in React</h1><p>Our goal today is to build a simple web application which will allow us to drag an object from one React container and add it to another. There are many ways to do this, but today will will accomplish this by using the React DnD Library. As usual I suggest you familiarize yourself with the&nbsp;<a href=\"https://react-dnd.github.io/react-dnd/docs/overview\" rel=\"noopener noreferrer\" target=\"_blank\">React DnD Docs</a>&nbsp;before starting, but I will do my best to quickly highlight the relevant info you’ll need to build the example.</p><p><br></p><p>Once installed, it will be helpful to familiarize yourself with the way React DnD works as a “middle-man” between React and the DOM.</p><p><img src=\"https://miro.medium.com/max/875/1*bXy_BEa7fAxpBhWA2p-OHQ.png\"></p><p>React-Dnd works as in intermediary between React and the DOM</p><h2>Communication between the DOM and React-Dnd</h2><p>Lets start with how to DOM Communicates with React-DnD and vice versa.</p><p><br></p><p>React-DnD is built on top of the&nbsp;<a href=\"https://developer.mozilla.org/en-US/docs/Web/API/HTML_Drag_and_Drop_API\" rel=\"noopener noreferrer\" target=\"_blank\">HTML Drag and Drop API</a>. The React-Dnd library comes with several pluggable implementations for use in browser, using touch-events, mouse events, etc. Each of these is called a&nbsp;<strong>Backend</strong>. For our demonstration we will be using the HTML5 backend that comes standard.</p><p>When you drag something across the screen, its not an element or dom node thats being dragged, we call the dragged object an&nbsp;<strong>item.&nbsp;</strong>Each item is a plain JavaScript object describing what’s being dragged. Each item must have an&nbsp;<strong>Item Type</strong>&nbsp;which we use to specify what can be dropped where (for example a container can be set up to only accept items with the item type of “card”).</p><p>Lastly,<strong>&nbsp;monitors</strong>&nbsp;let you update the props of your components in response to the drag and drop state changes. In simpler terms, they “monitor” the state of each object. Is it being dragged? Is something being dragged over it? Was something just dropped on it?</p>",
      "like": 0,
      "status": "pending",
      "createDate": "2022/04/13 08:18:11",
      "_id": {
        "$oid": "625639eb542f678cfadaa551"
      }
    }
  ],
  "__v": 0
},{
  "_id": {
    "$oid": "62566d406863925c53649681"
  },
  "source_id": {
    "$oid": "62566c3e6863925c53649651"
  },
  "blog": [
    {
      "title": "hhhhhh",
      "image": "http://127.0.0.1:8000/image/16498312324861_sf6MRFPfD8zp7s0R9fMPFA.png",
      "path": "src\\public\\image\\16498312324861_sf6MRFPfD8zp7s0R9fMPFA.png",
      "category": "news",
      "discription": "<p><strong>Methodology:</strong></p><p>The model was built on past 636 matches and a resource table was created i.e a 20*10 matrix of the resources available to the batting team .Isotonic regression in R was used for generating the table based on past match patterns.</p><p><img src=\"https://miro.medium.com/max/875/1*VvGJMnUd3sSDJ-D7FaOgpQ.png\"></p><p>Resource Table for predicting scores</p><p>The first yellow line to be read as: If the batting team has scored 50 runs for 3 wickets at the end of 6 overs, resources left are&nbsp;<strong>63.7% i.e&nbsp;</strong>the team can score&nbsp;<strong>50+63%*50/37%= 135&nbsp;</strong>runs in this innings. This is similar to Duckworth-Lewis system used in 50 overs cricket but customized to a shorter game format.Based on this,Fair score is calculated at each checkpoint during 2nd innings and winner is predicted first followed by length of the match.</p><p>I have hosted the final dashboard at:&nbsp;<a href=\"https://public.tableau.com/profile/ravi.shankar1671#!/vizhome/IPL_LengthPrediction/Dashboard_IPL\" rel=\"noopener noreferrer\" target=\"_blank\">https://public.tableau.com/profile/ravi.shankar1671#!/vizhome/IPL_LengthPrediction/Dashboard_IPL</a>.</p><p>It is a Plug and P layTableau public DB with data spanning across all the matches, Scores comparison of a match, live points table and over prediction at various match stages.</p><p><img src=\"https://miro.medium.com/max/875/1*GV3kh1U6HqmKBC6XZNkp8g.png\"></p><p>Dashboard for all the seasons combined</p><p>The algorithm resulted in a prediction of match length within +-2 overs in &gt;90% of the matches.The only major outlier in the model was seen when Dhoni came with CSK 4 wickets down still needing 150+ runs and converted an improbable chase to a last over victory. The plan is to expand this model to a web-API with live score scraping capability(Next Post) so as to estimate the probabilities in real time and earn some money while betting!!</p><p><br></p><p>80</p>",
      "like": 0,
      "status": "verified",
      "createDate": "2022/04/13 11:57:12",
      "_id": {
        "$oid": "62566d406863925c53649682"
      }
    }
  ],
  "__v": 0
},{
  "_id": {
    "$oid": "62628a21707f1a69c9d77bb8"
  },
  "source_id": {
    "$oid": "6262831c95aa9d732b4c393c"
  },
  "blog": [],
  "__v": 0
}]